{
    "books": [
        {
            "book": "Moses",
            "chapters": [
                {
                    "chapter": 1,
                    "reference": "Moses 1",
                    "verses": [
                        {
                            "reference": "Moses 1:1",
                            "text": "The words of God, which he spake unto Moses at a time when Moses was caught up into an exceedingly high mountain,",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 1:2",
                            "text": "And he saw God face to face, and he talked with him, and the glory of God was upon Moses; therefore Moses could endure his presence.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 1:3",
                            "text": "And God spake unto Moses, saying: Behold, I am the Lord God Almighty, and Endless is my name; for I am without beginning of days or end of years; and is not this endless?",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 1:4",
                            "text": "And, behold, thou art my son; wherefore look, and I will show thee the workmanship of mine hands; but not all, for my works are without end, and also my words, for they never cease.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 1:5",
                            "text": "Wherefore, no man can behold all my works, except he behold all my glory; and no man can behold all my glory, and afterwards remain in the flesh on the earth.",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 1:6",
                            "text": "And I have a work for thee, Moses, my son; and thou art in the similitude of mine Only Begotten; and mine Only Begotten is and shall be the Savior, for he is full of grace and truth; but there is no God beside me, and all things are present with me, for I know them all.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 1:7",
                            "text": "And now, behold, this one thing I show unto thee, Moses, my son, for thou art in the world, and now I show it unto thee.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 1:8",
                            "text": "And it came to pass that Moses looked, and beheld the world upon which he was created; and Moses beheld the world and the ends thereof, and all the children of men which are, and which were created; of the same he greatly marveled and wondered.",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 1:9",
                            "text": "And the presence of God withdrew from Moses, that his glory was not upon Moses; and Moses was left unto himself. And as he was left unto himself, he fell unto the earth.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 1:10",
                            "text": "And it came to pass that it was for the space of many hours before Moses did again receive his natural strength like unto man; and he said unto himself: Now, for this cause I know that man is nothing, which thing I never had supposed.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 1:11",
                            "text": "But now mine own eyes have beheld God; but not my natural, but my spiritual eyes, for my natural eyes could not have beheld; for I should have withered and died in his presence; but his glory was upon me; and I beheld his face, for I was transfigured before him.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 1:12",
                            "text": "And it came to pass that when Moses had said these words, behold, Satan came tempting him, saying: Moses, son of man, worship me.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 1:13",
                            "text": "And it came to pass that Moses looked upon Satan and said: Who art thou? For behold, I am a son of God, in the similitude of his Only Begotten; and where is thy glory, that I should worship thee?",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 1:14",
                            "text": "For behold, I could not look upon God, except his glory should come upon me, and I were transfigured before him. But I can look upon thee in the natural man. Is it not so, surely?",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 1:15",
                            "text": "Blessed be the name of my God, for his Spirit hath not altogether withdrawn from me, or else where is thy glory, for it is darkness unto me? And I can judge between thee and God; for God said unto me: Worship God, for him only shalt thou serve.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 1:16",
                            "text": "Get thee hence, Satan; deceive me not; for God said unto me: Thou art after the similitude of mine Only Begotten.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 1:17",
                            "text": "And he also gave me commandments when he called unto me out of the burning bush, saying: Call upon God in the name of mine Only Begotten, and worship me.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 1:18",
                            "text": "And again Moses said: I will not cease to call upon God, I have other things to inquire of him: for his glory has been upon me, wherefore I can judge between him and thee. Depart hence, Satan.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 1:19",
                            "text": "And now, when Moses had said these words, Satan cried with a loud voice, and ranted upon the earth, and commanded, saying: I am the Only Begotten, worship me.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 1:20",
                            "text": "And it came to pass that Moses began to fear exceedingly; and as he began to fear, he saw the bitterness of hell. Nevertheless, calling upon God, he received strength, and he commanded, saying: Depart from me, Satan, for this one God only will I worship, which is the God of glory.",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 1:21",
                            "text": "And now Satan began to tremble, and the earth shook; and Moses received strength, and called upon God, saying: In the name of the Only Begotten, depart hence, Satan.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 1:22",
                            "text": "And it came to pass that Satan cried with a loud voice, with weeping, and wailing, and gnashing of teeth; and he departed hence, even from the presence of Moses, that he beheld him not.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 1:23",
                            "text": "And now of this thing Moses bore record; but because of wickedness it is not had among the children of men.",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 1:24",
                            "text": "And it came to pass that when Satan had departed from the presence of Moses, that Moses lifted up his eyes unto heaven, being filled with the Holy Ghost, which beareth record of the Father and the Son;",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 1:25",
                            "text": "And calling upon the name of God, he beheld his glory again, for it was upon him; and he heard a voice, saying: Blessed art thou, Moses, for I, the Almighty, have chosen thee, and thou shalt be made stronger than many waters; for they shall obey thy command as if thou wert God.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 1:26",
                            "text": "And lo, I am with thee, even unto the end of thy days; for thou shalt deliver my people from bondage, even Israel my chosen.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 1:27",
                            "text": "And it came to pass, as the voice was still speaking, Moses cast his eyes and beheld the earth, yea, even all of it; and there was not a particle of it which he did not behold, discerning it by the Spirit of God.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 1:28",
                            "text": "And he beheld also the inhabitants thereof, and there was not a soul which he beheld not; and he discerned them by the Spirit of God; and their numbers were great, even numberless as the sand upon the sea shore.",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 1:29",
                            "text": "And he beheld many lands; and each land was called earth, and there were inhabitants on the face thereof.",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 1:30",
                            "text": "And it came to pass that Moses called upon God, saying: Tell me, I pray thee, why these things are so, and by what thou madest them?",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 1:31",
                            "text": "And behold, the glory of the Lord was upon Moses, so that Moses stood in the presence of God, and talked with him face to face. And the Lord God said unto Moses: For mine own purpose have I made these things. Here is wisdom and it remaineth in me.",
                            "verse": 31
                        },
                        {
                            "reference": "Moses 1:32",
                            "text": "And by the word of my power, have I created them, which is mine Only Begotten Son, who is full of grace and truth.",
                            "verse": 32
                        },
                        {
                            "reference": "Moses 1:33",
                            "text": "And worlds without number have I created; and I also created them for mine own purpose; and by the Son I created them, which is mine Only Begotten.",
                            "verse": 33
                        },
                        {
                            "reference": "Moses 1:34",
                            "text": "And the first man of all men have I called Adam, which is many.",
                            "verse": 34
                        },
                        {
                            "reference": "Moses 1:35",
                            "text": "But only an account of this earth, and the inhabitants thereof, give I unto you. For behold, there are many worlds that have passed away by the word of my power. And there are many that now stand, and innumerable are they unto man; but all things are numbered unto me, for they are mine and I know them.",
                            "verse": 35
                        },
                        {
                            "reference": "Moses 1:36",
                            "text": "And it came to pass that Moses spake unto the Lord, saying: Be merciful unto thy servant, O God, and tell me concerning this earth, and the inhabitants thereof, and also the heavens, and then thy servant will be content.",
                            "verse": 36
                        },
                        {
                            "reference": "Moses 1:37",
                            "text": "And the Lord God spake unto Moses, saying: The heavens, they are many, and they cannot be numbered unto man; but they are numbered unto me, for they are mine.",
                            "verse": 37
                        },
                        {
                            "reference": "Moses 1:38",
                            "text": "And as one earth shall pass away, and the heavens thereof even so shall another come; and there is no end to my works, neither to my words.",
                            "verse": 38
                        },
                        {
                            "reference": "Moses 1:39",
                            "text": "For behold, this is my work and my glory—to bring to pass the immortality and eternal life of man.",
                            "verse": 39
                        },
                        {
                            "reference": "Moses 1:40",
                            "text": "And now, Moses, my son, I will speak unto thee concerning this earth upon which thou standest; and thou shalt write the things which I shall speak.",
                            "verse": 40
                        },
                        {
                            "reference": "Moses 1:41",
                            "text": "And in a day when the children of men shall esteem my words as naught and take many of them from the book which thou shalt write, behold, I will raise up another like unto thee; and they shall be had again among the children of men—among as many as shall believe.",
                            "verse": 41
                        },
                        {
                            "reference": "Moses 1:42",
                            "text": "(These words were spoken unto Moses in the mount, the name of which shall not be known among the children of men. And now they are spoken unto you. Show them not unto any except them that believe. Even so. Amen.)",
                            "verse": 42
                        }
                    ]
                },
                {
                    "chapter": 2,
                    "reference": "Moses 2",
                    "verses": [
                        {
                            "reference": "Moses 2:1",
                            "text": "And it came to pass that the Lord spake unto Moses, saying: Behold, I reveal unto you concerning this heaven, and this earth; write the words which I speak. I am the Beginning and the End, the Almighty God; by mine Only Begotten I created these things; yea, in the beginning I created the heaven, and the earth upon which thou standest.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 2:2",
                            "text": "And the earth was without form, and void; and I caused darkness to come up upon the face of the deep; and my Spirit moved upon the face of the water; for I am God.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 2:3",
                            "text": "And I, God, said: Let there be light; and there was light.",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 2:4",
                            "text": "And I, God, saw the light; and that light was good. And I, God, divided the light from the darkness.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 2:5",
                            "text": "And I, God, called the light Day; and the darkness, I called Night; and this I did by the word of my power, and it was done as I spake; and the evening and the morning were the first day.",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 2:6",
                            "text": "And again, I, God, said: Let there be a firmament in the midst of the water, and it was so, even as I spake; and I said: Let it divide the waters from the waters; and it was done;",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 2:7",
                            "text": "And I, God, made the firmament and divided the waters, yea, the great waters under the firmament from the waters which were above the firmament, and it was so even as I spake.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 2:8",
                            "text": "And I, God, called the firmament Heaven; and the evening and the morning were the second day.",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 2:9",
                            "text": "And I, God, said: Let the waters under the heaven be gathered together unto one place, and it was so; and I, God, said: Let there be dry land; and it was so.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 2:10",
                            "text": "And I, God, called the dry land Earth; and the gathering together of the waters, called I the Sea; and I, God, saw that all things which I had made were good.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 2:11",
                            "text": "And I, God, said: Let the earth bring forth grass, the herb yielding seed, the fruit tree yielding fruit, after his kind, and the tree yielding fruit, whose seed should be in itself upon the earth, and it was so even as I spake.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 2:12",
                            "text": "And the earth brought forth grass, every herb yielding seed after his kind, and the tree yielding fruit, whose seed should be in itself, after his kind; and I, God, saw that all things which I had made were good;",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 2:13",
                            "text": "And the evening and the morning were the third day.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 2:14",
                            "text": "And I, God, said: Let there be lights in the firmament of the heaven, to divide the day from the night, and let them be for signs, and for seasons, and for days, and for years;",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 2:15",
                            "text": "And let them be for lights in the firmament of the heaven to give light upon the earth; and it was so.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 2:16",
                            "text": "And I, God, made two great lights; the greater light to rule the day, and the lesser light to rule the night, and the greater light was the sun, and the lesser light was the moon; and the stars also were made even according to my word.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 2:17",
                            "text": "And I, God, set them in the firmament of the heaven to give light upon the earth,",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 2:18",
                            "text": "And the sun to rule over the day, and the moon to rule over the night, and to divide the light from the darkness; and I, God, saw that all things which I had made were good;",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 2:19",
                            "text": "And the evening and the morning were the fourth day.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 2:20",
                            "text": "And I, God, said: Let the waters bring forth abundantly the moving creature that hath life, and fowl which may fly above the earth in the open firmament of heaven.",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 2:21",
                            "text": "And I, God, created great whales, and every living creature that moveth, which the waters brought forth abundantly, after their kind, and every winged fowl after his kind; and I, God, saw that all things which I had created were good.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 2:22",
                            "text": "And I, God, blessed them, saying: Be fruitful, and multiply, and fill the waters in the sea; and let fowl multiply in the earth;",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 2:23",
                            "text": "And the evening and the morning were the fifth day.",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 2:24",
                            "text": "And I, God, said: Let the earth bring forth the living creature after his kind, cattle, and creeping things, and beasts of the earth after their kind, and it was so;",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 2:25",
                            "text": "And I, God, made the beasts of the earth after their kind, and cattle after their kind, and everything which creepeth upon the earth after his kind; and I, God, saw that all these things were good.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 2:26",
                            "text": "And I, God, said unto mine Only Begotten, which was with me from the beginning: Let us make man in our image, after our likeness; and it was so. And I, God, said: Let them have dominion over the fishes of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 2:27",
                            "text": "And I, God, created man in mine own image, in the image of mine Only Begotten created I him; male and female created I them.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 2:28",
                            "text": "And I, God, blessed them, and said unto them: Be fruitful, and multiply, and replenish the earth, and subdue it, and have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 2:29",
                            "text": "And I, God, said unto man: Behold, I have given you every herb bearing seed, which is upon the face of all the earth, and every tree in the which shall be the fruit of a tree yielding seed; to you it shall be for meat.",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 2:30",
                            "text": "And to every beast of the earth, and to every fowl of the air, and to everything that creepeth upon the earth, wherein I grant life, there shall be given every clean herb for meat; and it was so, even as I spake.",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 2:31",
                            "text": "And I, God, saw everything that I had made, and, behold, all things which I had made were very good; and the evening and the morning were the sixth day.",
                            "verse": 31
                        }
                    ]
                },
                {
                    "chapter": 3,
                    "reference": "Moses 3",
                    "verses": [
                        {
                            "reference": "Moses 3:1",
                            "text": "Thus the heaven and the earth were finished, and all the host of them.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 3:2",
                            "text": "And on the seventh day I, God, ended my work, and all things which I had made; and I rested on the seventh day from all my work, and all things which I had made were finished, and I, God, saw that they were good;",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 3:3",
                            "text": "And I, God, blessed the seventh day, and sanctified it; because that in it I had rested from all my work which I, God, had created and made.",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 3:4",
                            "text": "And now, behold, I say unto you, that these are the generations of the heaven and of the earth, when they were created, in the day that I, the Lord God, made the heaven and the earth,",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 3:5",
                            "text": "And every plant of the field before it was in the earth, and every herb of the field before it grew. For I, the Lord God, created all things, of which I have spoken, spiritually, before they were naturally upon the face of the earth. For I, the Lord God, had not caused it to rain upon the face of the earth. And I, the Lord God, had created all the children of men; and not yet a man to till the ground; for in heaven created I them; and there was not yet flesh upon the earth, neither in the water, neither in the air;",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 3:6",
                            "text": "But I, the Lord God, spake, and there went up a mist from the earth, and watered the whole face of the ground.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 3:7",
                            "text": "And I, the Lord God, formed man from the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul, the first flesh upon the earth, the first man also; nevertheless, all things were before created; but spiritually were they created and made according to my word.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 3:8",
                            "text": "And I, the Lord God, planted a garden eastward in Eden, and there I put the man whom I had formed.",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 3:9",
                            "text": "And out of the ground made I, the Lord God, to grow every tree, naturally, that is pleasant to the sight of man; and man could behold it. And it became also a living soul. For it was spiritual in the day that I created it; for it remaineth in the sphere in which I, God, created it, yea, even all things which I prepared for the use of man; and man saw that it was good for food. And I, the Lord God, planted the tree of life also in the midst of the garden, and also the tree of knowledge of good and evil.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 3:10",
                            "text": "And I, the Lord God, caused a river to go out of Eden to water the garden; and from thence it was parted, and became into four heads.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 3:11",
                            "text": "And I, the Lord God, called the name of the first Pison, and it compasseth the whole land of Havilah, where I, the Lord God, created much gold;",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 3:12",
                            "text": "And the gold of that land was good, and there was bdellium and the onyx stone.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 3:13",
                            "text": "And the name of the second river was called Gihon; the same that compasseth the whole land of Ethiopia.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 3:14",
                            "text": "And the name of the third river was Hiddekel; that which goeth toward the east of Assyria. And the fourth river was the Euphrates.",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 3:15",
                            "text": "And I, the Lord God, took the man, and put him into the Garden of Eden, to dress it, and to keep it.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 3:16",
                            "text": "And I, the Lord God, commanded the man, saying: Of every tree of the garden thou mayest freely eat,",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 3:17",
                            "text": "But of the tree of the knowledge of good and evil, thou shalt not eat of it, nevertheless, thou mayest choose for thyself, for it is given unto thee; but, remember that I forbid it, for in the day thou eatest thereof thou shalt surely die.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 3:18",
                            "text": "And I, the Lord God, said unto mine Only Begotten, that it was not good that the man should be alone; wherefore, I will make an help meet for him.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 3:19",
                            "text": "And out of the ground I, the Lord God, formed every beast of the field, and every fowl of the air; and commanded that they should come unto Adam, to see what he would call them; and they were also living souls; for I, God, breathed into them the breath of life, and commanded that whatsoever Adam called every living creature, that should be the name thereof.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 3:20",
                            "text": "And Adam gave names to all cattle, and to the fowl of the air, and to every beast of the field; but as for Adam, there was not found an help meet for him.",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 3:21",
                            "text": "And I, the Lord God, caused a deep sleep to fall upon Adam; and he slept, and I took one of his ribs and closed up the flesh in the stead thereof;",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 3:22",
                            "text": "And the rib which I, the Lord God, had taken from man, made I a woman, and brought her unto the man.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 3:23",
                            "text": "And Adam said: This I know now is bone of my bones, and flesh of my flesh; she shall be called Woman, because she was taken out of man.",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 3:24",
                            "text": "Therefore shall a man leave his father and his mother, and shall cleave unto his wife; and they shall be one flesh.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 3:25",
                            "text": "And they were both naked, the man and his wife, and were not ashamed.",
                            "verse": 25
                        }
                    ]
                },
                {
                    "chapter": 4,
                    "reference": "Moses 4",
                    "verses": [
                        {
                            "reference": "Moses 4:1",
                            "text": "And I, the Lord God, spake unto Moses, saying: That Satan, whom thou hast commanded in the name of mine Only Begotten, is the same which was from the beginning, and he came before me, saying—Behold, here am I, send me, I will be thy son, and I will redeem all mankind, that one soul shall not be lost, and surely I will do it; wherefore give me thine honor.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 4:2",
                            "text": "But, behold, my Beloved Son, which was my Beloved and Chosen from the beginning, said unto me—Father, thy will be done, and the glory be thine forever.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 4:3",
                            "text": "Wherefore, because that Satan rebelled against me, and sought to destroy the agency of man, which I, the Lord God, had given him, and also, that I should give unto him mine own power; by the power of mine Only Begotten, I caused that he should be cast down;",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 4:4",
                            "text": "And he became Satan, yea, even the devil, the father of all lies, to deceive and to blind men, and to lead them captive at his will, even as many as would not hearken unto my voice.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 4:5",
                            "text": "And now the serpent was more subtle than any beast of the field which I, the Lord God, had made.",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 4:6",
                            "text": "And Satan put it into the heart of the serpent, (for he had drawn away many after him,) and he sought also to beguile Eve, for he knew not the mind of God, wherefore he sought to destroy the world.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 4:7",
                            "text": "And he said unto the woman: Yea, hath God said—Ye shall not eat of every tree of the garden? (And he spake by the mouth of the serpent.)",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 4:8",
                            "text": "And the woman said unto the serpent: We may eat of the fruit of the trees of the garden;",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 4:9",
                            "text": "But of the fruit of the tree which thou beholdest in the midst of the garden, God hath said—Ye shall not eat of it, neither shall ye touch it, lest ye die.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 4:10",
                            "text": "And the serpent said unto the woman: Ye shall not surely die;",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 4:11",
                            "text": "For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 4:12",
                            "text": "And when the woman saw that the tree was good for food, and that it became pleasant to the eyes, and a tree to be desired to make her wise, she took of the fruit thereof, and did eat, and also gave unto her husband with her, and he did eat.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 4:13",
                            "text": "And the eyes of them both were opened, and they knew that they had been naked. And they sewed fig leaves together and made themselves aprons.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 4:14",
                            "text": "And they heard the voice of the Lord God, as they were walking in the garden, in the cool of the day; and Adam and his wife went to hide themselves from the presence of the Lord God amongst the trees of the garden.",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 4:15",
                            "text": "And I, the Lord God, called unto Adam, and said unto him: Where goest thou?",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 4:16",
                            "text": "And he said: I heard thy voice in the garden, and I was afraid, because I beheld that I was naked, and I hid myself.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 4:17",
                            "text": "And I, the Lord God, said unto Adam: Who told thee thou wast naked? Hast thou eaten of the tree whereof I commanded thee that thou shouldst not eat, if so thou shouldst surely die?",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 4:18",
                            "text": "And the man said: The woman thou gavest me, and commandest that she should remain with me, she gave me of the fruit of the tree and I did eat.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 4:19",
                            "text": "And I, the Lord God, said unto the woman: What is this thing which thou hast done? And the woman said: The serpent beguiled me, and I did eat.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 4:20",
                            "text": "And I, the Lord God, said unto the serpent: Because thou hast done this thou shalt be cursed above all cattle, and above every beast of the field; upon thy belly shalt thou go, and dust shalt thou eat all the days of thy life;",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 4:21",
                            "text": "And I will put enmity between thee and the woman, between thy seed and her seed; and he shall bruise thy head, and thou shalt bruise his heel.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 4:22",
                            "text": "Unto the woman, I, the Lord God, said: I will greatly multiply thy sorrow and thy conception. In sorrow thou shalt bring forth children, and thy desire shall be to thy husband, and he shall rule over thee.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 4:23",
                            "text": "And unto Adam, I, the Lord God, said: Because thou hast hearkened unto the voice of thy wife, and hast eaten of the fruit of the tree of which I commanded thee, saying—Thou shalt not eat of it, cursed shall be the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life.",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 4:24",
                            "text": "Thorns also, and thistles shall it bring forth to thee, and thou shalt eat the herb of the field.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 4:25",
                            "text": "By the sweat of thy face shalt thou eat bread, until thou shalt return unto the ground—for thou shalt surely die—for out of it wast thou taken: for dust thou wast, and unto dust shalt thou return.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 4:26",
                            "text": "And Adam called his wife's name Eve, because she was the mother of all living; for thus have I, the Lord God, called the first of all women, which are many.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 4:27",
                            "text": "Unto Adam, and also unto his wife, did I, the Lord God, make coats of skins, and clothed them.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 4:28",
                            "text": "And I, the Lord God, said unto mine Only Begotten: Behold, the man is become as one of us to know good and evil; and now lest he put forth his hand and partake also of the tree of life, and eat and live forever,",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 4:29",
                            "text": "Therefore I, the Lord God, will send him forth from the Garden of Eden, to till the ground from whence he was taken;",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 4:30",
                            "text": "For as I, the Lord God, liveth, even so my words cannot return void, for as they go forth out of my mouth they must be fulfilled.",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 4:31",
                            "text": "So I drove out the man, and I placed at the east of the Garden of Eden, cherubim and a flaming sword, which turned every way to keep the way of the tree of life.",
                            "verse": 31
                        },
                        {
                            "reference": "Moses 4:32",
                            "text": "(And these are the words which I spake unto my servant Moses, and they are true even as I will; and I have spoken them unto you. See thou show them unto no man, until I command you, except to them that believe. Amen.)",
                            "verse": 32
                        }
                    ]
                },
                {
                    "chapter": 5,
                    "reference": "Moses 5",
                    "verses": [
                        {
                            "reference": "Moses 5:1",
                            "text": "And it came to pass that after I, the Lord God, had driven them out, that Adam began to till the earth, and to have dominion over all the beasts of the field, and to eat his bread by the sweat of his brow, as I the Lord had commanded him. And Eve, also, his wife, did labor with him.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 5:2",
                            "text": "And Adam knew his wife, and she bare unto him sons and daughters, and they began to multiply and to replenish the earth.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 5:3",
                            "text": "And from that time forth, the sons and daughters of Adam began to divide two and two in the land, and to till the land, and to tend flocks, and they also begat sons and daughters.",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 5:4",
                            "text": "And Adam and Eve, his wife, called upon the name of the Lord, and they heard the voice of the Lord from the way toward the Garden of Eden, speaking unto them, and they saw him not; for they were shut out from his presence.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 5:5",
                            "text": "And he gave unto them commandments, that they should worship the Lord their God, and should offer the firstlings of their flocks, for an offering unto the Lord. And Adam was obedient unto the commandments of the Lord.",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 5:6",
                            "text": "And after many days an angel of the Lord appeared unto Adam, saying: Why dost thou offer sacrifices unto the Lord? And Adam said unto him: I know not, save the Lord commanded me.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 5:7",
                            "text": "And then the angel spake, saying: This thing is a similitude of the sacrifice of the Only Begotten of the Father, which is full of grace and truth.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 5:8",
                            "text": "Wherefore, thou shalt do all that thou doest in the name of the Son, and thou shalt repent and call upon God in the name of the Son forevermore.",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 5:9",
                            "text": "And in that day the Holy Ghost fell upon Adam, which beareth record of the Father and the Son, saying: I am the Only Begotten of the Father from the beginning, henceforth and forever, that as thou hast fallen thou mayest be redeemed, and all mankind, even as many as will.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 5:10",
                            "text": "And in that day Adam blessed God and was filled, and began to prophesy concerning all the families of the earth, saying: Blessed be the name of God, for because of my transgression my eyes are opened, and in this life I shall have joy, and again in the flesh I shall see God.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 5:11",
                            "text": "And Eve, his wife, heard all these things and was glad, saying: Were it not for our transgression we never should have had seed, and never should have known good and evil, and the joy of our redemption, and the eternal life which God giveth unto all the obedient.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 5:12",
                            "text": "And Adam and Eve blessed the name of God, and they made all things known unto their sons and their daughters.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 5:13",
                            "text": "And Satan came among them, saying: I am also a son of God; and he commanded them, saying: Believe it not; and they believed it not, and they loved Satan more than God. And men began from that time forth to be carnal, sensual, and devilish.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 5:14",
                            "text": "And the Lord God called upon men by the Holy Ghost everywhere and commanded them that they should repent;",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 5:15",
                            "text": "And as many as believed in the Son, and repented of their sins, should be saved; and as many as believed not and repented not, should be damned; and the words went forth out of the mouth of God in a firm decree; wherefore they must be fulfilled.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 5:16",
                            "text": "And Adam and Eve, his wife, ceased not to call upon God. And Adam knew Eve his wife, and she conceived and bare Cain, and said: I have gotten a man from the Lord; wherefore he may not reject his words. But behold, Cain hearkened not, saying: Who is the Lord that I should know him?",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 5:17",
                            "text": "And she again conceived and bare his brother Abel. And Abel hearkened unto the voice of the Lord. And Abel was a keeper of sheep, but Cain was a tiller of the ground.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 5:18",
                            "text": "And Cain loved Satan more than God. And Satan commanded him, saying: Make an offering unto the Lord.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 5:19",
                            "text": "And in process of time it came to pass that Cain brought of the fruit of the ground an offering unto the Lord.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 5:20",
                            "text": "And Abel, he also brought of the firstlings of his flock, and of the fat thereof. And the Lord had respect unto Abel, and to his offering;",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 5:21",
                            "text": "But unto Cain, and to his offering, he had not respect. Now Satan knew this, and it pleased him. And Cain was very wroth, and his countenance fell.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 5:22",
                            "text": "And the Lord said unto Cain: Why art thou wroth? Why is thy countenance fallen?",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 5:23",
                            "text": "If thou doest well, thou shalt be accepted. And if thou doest not well, sin lieth at the door, and Satan desireth to have thee; and except thou shalt hearken unto my commandments, I will deliver thee up, and it shall be unto thee according to his desire. And thou shalt rule over him;",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 5:24",
                            "text": "For from this time forth thou shalt be the father of his lies; thou shalt be called Perdition; for thou wast also before the world.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 5:25",
                            "text": "And it shall be said in time to come—That these abominations were had from Cain; for he rejected the greater counsel which was had from God; and this is a cursing which I will put upon thee, except thou repent.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 5:26",
                            "text": "And Cain was wroth, and listened not any more to the voice of the Lord, neither to Abel, his brother, who walked in holiness before the Lord.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 5:27",
                            "text": "And Adam and his wife mourned before the Lord, because of Cain and his brethren.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 5:28",
                            "text": "And it came to pass that Cain took one of his brothers' daughters to wife, and they loved Satan more than God.",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 5:29",
                            "text": "And Satan said unto Cain: Swear unto me by thy throat, and if thou tell it thou shalt die; and swear thy brethren by their heads, and by the living God, that they tell it not; for if they tell it, they shall surely die; and this that thy father may not know it; and this day I will deliver thy brother Abel into thine hands.",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 5:30",
                            "text": "And Satan sware unto Cain that he would do according to his commands. And all these things were done in secret.",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 5:31",
                            "text": "And Cain said: Truly I am Mahan, the master of this great secret, that I may murder and get gain. Wherefore Cain was called Master Mahan, and he gloried in his wickedness.",
                            "verse": 31
                        },
                        {
                            "reference": "Moses 5:32",
                            "text": "And Cain went into the field, and Cain talked with Abel, his brother. And it came to pass that while they were in the field, Cain rose up against Abel, his brother, and slew him.",
                            "verse": 32
                        },
                        {
                            "reference": "Moses 5:33",
                            "text": "And Cain gloried in that which he had done, saying: I am free; surely the flocks of my brother falleth into my hands.",
                            "verse": 33
                        },
                        {
                            "reference": "Moses 5:34",
                            "text": "And the Lord said unto Cain: Where is Abel, thy brother? And he said: I know not. Am I my brother's keeper?",
                            "verse": 34
                        },
                        {
                            "reference": "Moses 5:35",
                            "text": "And the Lord said: What hast thou done? The voice of thy brother's blood cries unto me from the ground.",
                            "verse": 35
                        },
                        {
                            "reference": "Moses 5:36",
                            "text": "And now thou shalt be cursed from the earth which hath opened her mouth to receive thy brother's blood from thy hand.",
                            "verse": 36
                        },
                        {
                            "reference": "Moses 5:37",
                            "text": "When thou tillest the ground it shall not henceforth yield unto thee her strength. A fugitive and a vagabond shalt thou be in the earth.",
                            "verse": 37
                        },
                        {
                            "reference": "Moses 5:38",
                            "text": "And Cain said unto the Lord: Satan tempted me because of my brother's flocks. And I was wroth also; for his offering thou didst accept and not mine; my punishment is greater than I can bear.",
                            "verse": 38
                        },
                        {
                            "reference": "Moses 5:39",
                            "text": "Behold thou hast driven me out this day from the face of the Lord, and from thy face shall I be hid; and I shall be a fugitive and a vagabond in the earth; and it shall come to pass, that he that findeth me will slay me, because of mine iniquities, for these things are not hid from the Lord.",
                            "verse": 39
                        },
                        {
                            "reference": "Moses 5:40",
                            "text": "And I the Lord said unto him: Whosoever slayeth thee, vengeance shall be taken on him sevenfold. And I the Lord set a mark upon Cain, lest any finding him should kill him.",
                            "verse": 40
                        },
                        {
                            "reference": "Moses 5:41",
                            "text": "And Cain was shut out from the presence of the Lord, and with his wife and many of his brethren dwelt in the land of Nod, on the east of Eden.",
                            "verse": 41
                        },
                        {
                            "reference": "Moses 5:42",
                            "text": "And Cain knew his wife, and she conceived and bare Enoch, and he also begat many sons and daughters. And he builded a city, and he called the name of the city after the name of his son, Enoch.",
                            "verse": 42
                        },
                        {
                            "reference": "Moses 5:43",
                            "text": "And unto Enoch was born Irad, and other sons and daughters. And Irad begat Mahujael, and other sons and daughters. And Mahujael begat Methusael, and other sons and daughters. And Methusael begat Lamech.",
                            "verse": 43
                        },
                        {
                            "reference": "Moses 5:44",
                            "text": "And Lamech took unto himself two wives; the name of one being Adah, and the name of the other, Zillah.",
                            "verse": 44
                        },
                        {
                            "reference": "Moses 5:45",
                            "text": "And Adah bare Jabal; he was the father of such as dwell in tents, and they were keepers of cattle; and his brother's name was Jubal, who was the father of all such as handle the harp and organ.",
                            "verse": 45
                        },
                        {
                            "reference": "Moses 5:46",
                            "text": "And Zillah, she also bare Tubal Cain, an instructor of every artificer in brass and iron. And the sister of Tubal Cain was called Naamah.",
                            "verse": 46
                        },
                        {
                            "reference": "Moses 5:47",
                            "text": "And Lamech said unto his wives, Adah and Zillah: Hear my voice, ye wives of Lamech, hearken unto my speech; for I have slain a man to my wounding, and a young man to my hurt.",
                            "verse": 47
                        },
                        {
                            "reference": "Moses 5:48",
                            "text": "If Cain shall be avenged sevenfold, truly Lamech shall be seventy and seven fold;",
                            "verse": 48
                        },
                        {
                            "reference": "Moses 5:49",
                            "text": "For Lamech having entered into a covenant with Satan, after the manner of Cain, wherein he became Master Mahan, master of that great secret which was administered unto Cain by Satan; and Irad, the son of Enoch, having known their secret, began to reveal it unto the sons of Adam;",
                            "verse": 49
                        },
                        {
                            "reference": "Moses 5:50",
                            "text": "Wherefore Lamech, being angry, slew him, not like unto Cain, his brother Abel, for the sake of getting gain, but he slew him for the oath's sake.",
                            "verse": 50
                        },
                        {
                            "reference": "Moses 5:51",
                            "text": "For, from the days of Cain, there was a secret combination, and their works were in the dark, and they knew every man his brother.",
                            "verse": 51
                        },
                        {
                            "reference": "Moses 5:52",
                            "text": "Wherefore the Lord cursed Lamech, and his house, and all them that had covenanted with Satan; for they kept not the commandments of God, and it displeased God, and he ministered not unto them, and their works were abominations, and began to spread among all the sons of men. And it was among the sons of men.",
                            "verse": 52
                        },
                        {
                            "reference": "Moses 5:53",
                            "text": "And among the daughters of men these things were not spoken, because that Lamech had spoken the secret unto his wives, and they rebelled against him, and declared these things abroad, and had not compassion;",
                            "verse": 53
                        },
                        {
                            "reference": "Moses 5:54",
                            "text": "Wherefore Lamech was despised, and cast out, and came not among the sons of men, lest he should die.",
                            "verse": 54
                        },
                        {
                            "reference": "Moses 5:55",
                            "text": "And thus the works of darkness began to prevail among all the sons of men.",
                            "verse": 55
                        },
                        {
                            "reference": "Moses 5:56",
                            "text": "And God cursed the earth with a sore curse, and was angry with the wicked, with all the sons of men whom he had made;",
                            "verse": 56
                        },
                        {
                            "reference": "Moses 5:57",
                            "text": "For they would not hearken unto his voice, nor believe on his Only Begotten Son, even him whom he declared should come in the meridian of time, who was prepared from before the foundation of the world.",
                            "verse": 57
                        },
                        {
                            "reference": "Moses 5:58",
                            "text": "And thus the Gospel began to be preached, from the beginning, being declared by holy angels sent forth from the presence of God, and by his own voice, and by the gift of the Holy Ghost.",
                            "verse": 58
                        },
                        {
                            "reference": "Moses 5:59",
                            "text": "And thus all things were confirmed unto Adam, by an holy ordinance, and the Gospel preached, and a decree sent forth, that it should be in the world, until the end thereof; and thus it was. Amen.",
                            "verse": 59
                        }
                    ]
                },
                {
                    "chapter": 6,
                    "reference": "Moses 6",
                    "verses": [
                        {
                            "reference": "Moses 6:1",
                            "text": "And Adam hearkened unto the voice of God, and called upon his sons to repent.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 6:2",
                            "text": "And Adam knew his wife again, and she bare a son, and he called his name Seth. And Adam glorified the name of God; for he said: God hath appointed me another seed, instead of Abel, whom Cain slew.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 6:3",
                            "text": "And God revealed himself unto Seth, and he rebelled not, but offered an acceptable sacrifice, like unto his brother Abel. And to him also was born a son, and he called his name Enos.",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 6:4",
                            "text": "And then began these men to call upon the name of the Lord, and the Lord blessed them;",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 6:5",
                            "text": "And a book of remembrance was kept, in the which was recorded, in the language of Adam, for it was given unto as many as called upon God to write by the spirit of inspiration;",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 6:6",
                            "text": "And by them their children were taught to read and write, having a language which was pure and undefiled.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 6:7",
                            "text": "Now this same Priesthood, which was in the beginning, shall be in the end of the world also.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 6:8",
                            "text": "Now this prophecy Adam spake, as he was moved upon by the Holy Ghost, and a genealogy was kept of the children of God. And this was the book of the generations of Adam, saying: In the day that God created man, in the likeness of God made he him;",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 6:9",
                            "text": "In the image of his own body, male and female, created he them, and blessed them, and called their name Adam, in the day when they were created and became living souls in the land upon the footstool of God.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 6:10",
                            "text": "And Adam lived one hundred and thirty years, and begat a son in his own likeness, after his own image, and called his name Seth.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 6:11",
                            "text": "And the days of Adam, after he had begotten Seth, were eight hundred years, and he begat many sons and daughters;",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 6:12",
                            "text": "And all the days that Adam lived were nine hundred and thirty years, and he died.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 6:13",
                            "text": "Seth lived one hundred and five years, and begat Enos, and prophesied in all his days, and taught his son Enos in the ways of God; wherefore Enos prophesied also.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 6:14",
                            "text": "And Seth lived, after he begat Enos, eight hundred and seven years, and begat many sons and daughters.",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 6:15",
                            "text": "And the children of men were numerous upon all the face of the land. And in those days Satan had great dominion among men, and raged in their hearts; and from thenceforth came wars and bloodshed; and a man's hand was against his own brother, in administering death, because of secret works, seeking for power.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 6:16",
                            "text": "All the days of Seth were nine hundred and twelve years, and he died.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 6:17",
                            "text": "And Enos lived ninety years, and begat Cainan. And Enos and the residue of the people of God came out from the land, which was called Shulon, and dwelt in a land of promise, which he called after his own son, whom he had named Cainan.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 6:18",
                            "text": "And Enos lived, after he begat Cainan, eight hundred and fifteen years, and begat many sons and daughters. And all the days of Enos were nine hundred and five years, and he died.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 6:19",
                            "text": "And Cainan lived seventy years, and begat Mahalaleel; and Cainan lived after he begat Mahalaleel eight hundred and forty years, and begat sons and daughters. And all the days of Cainan were nine hundred and ten years, and he died.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 6:20",
                            "text": "And Mahalaleel lived sixty-five years, and begat Jared; and Mahalaleel lived, after he begat Jared, eight hundred and thirty years, and begat sons and daughters. And all the days of Mahalaleel were eight hundred and ninety-five years, and he died.",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 6:21",
                            "text": "And Jared lived one hundred and sixty-two years, and begat Enoch; and Jared lived, after he begat Enoch, eight hundred years, and begat sons and daughters. And Jared taught Enoch in all the ways of God.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 6:22",
                            "text": "And this is the genealogy of the sons of Adam, who was the son of God, with whom God, himself, conversed.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 6:23",
                            "text": "And they were preachers of righteousness, and spake and prophesied, and called upon all men, everywhere, to repent; and faith was taught unto the children of men.",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 6:24",
                            "text": "And it came to pass that all the days of Jared were nine hundred and sixty-two years, and he died.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 6:25",
                            "text": "And Enoch lived sixty-five years, and begat Methuselah.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 6:26",
                            "text": "And it came to pass that Enoch journeyed in the land, among the people; and as he journeyed, the Spirit of God descended out of heaven, and abode upon him.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 6:27",
                            "text": "And he heard a voice from heaven, saying: Enoch, my son, prophesy unto this people, and say unto them—Repent, for thus saith the Lord: I am angry with this people, and my fierce anger is kindled against them; for their hearts have waxed hard, and their ears are dull of hearing, and their eyes cannot see afar off;",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 6:28",
                            "text": "And for these many generations, ever since the day that I created them, have they gone astray, and have denied me, and have sought their own counsels in the dark; and in their own abominations have they devised murder, and have not kept the commandments, which I gave unto their father, Adam.",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 6:29",
                            "text": "Wherefore, they have foresworn themselves, and, by their oaths, they have brought upon themselves death; and a hell I have prepared for them, if they repent not;",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 6:30",
                            "text": "And this is a decree, which I have sent forth in the beginning of the world, from my own mouth, from the foundation thereof, and by the mouths of my servants, thy fathers, have I decreed it, even as it shall be sent forth in the world, unto the ends thereof.",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 6:31",
                            "text": "And when Enoch had heard these words, he bowed himself to the earth, before the Lord, and spake before the Lord, saying: Why is it that I have found favor in thy sight, and am but a lad, and all the people hate me; for I am slow of speech; wherefore am I thy servant?",
                            "verse": 31
                        },
                        {
                            "reference": "Moses 6:32",
                            "text": "And the Lord said unto Enoch: Go forth and do as I have commanded thee, and no man shall pierce thee. Open thy mouth, and it shall be filled, and I will give thee utterance, for all flesh is in my hands, and I will do as seemeth me good.",
                            "verse": 32
                        },
                        {
                            "reference": "Moses 6:33",
                            "text": "Say unto this people: Choose ye this day, to serve the Lord God who made you.",
                            "verse": 33
                        },
                        {
                            "reference": "Moses 6:34",
                            "text": "Behold my Spirit is upon you, wherefore all thy words will I justify; and the mountains shall flee before you, and the rivers shall turn from their course; and thou shalt abide in me, and I in you; therefore walk with me.",
                            "verse": 34
                        },
                        {
                            "reference": "Moses 6:35",
                            "text": "And the Lord spake unto Enoch, and said unto him: Anoint thine eyes with clay, and wash them, and thou shalt see. And he did so.",
                            "verse": 35
                        },
                        {
                            "reference": "Moses 6:36",
                            "text": "And he beheld the spirits that God had created; and he beheld also things which were not visible to the natural eye; and from thenceforth came the saying abroad in the land: A seer hath the Lord raised up unto his people.",
                            "verse": 36
                        },
                        {
                            "reference": "Moses 6:37",
                            "text": "And it came to pass that Enoch went forth in the land, among the people, standing upon the hills and the high places, and cried with a loud voice, testifying against their works; and all men were offended because of him.",
                            "verse": 37
                        },
                        {
                            "reference": "Moses 6:38",
                            "text": "And they came forth to hear him, upon the high places, saying unto the tent-keepers: Tarry ye here and keep the tents, while we go yonder to behold the seer, for he prophesieth, and there is a strange thing in the land; a wild man hath come among us.",
                            "verse": 38
                        },
                        {
                            "reference": "Moses 6:39",
                            "text": "And it came to pass when they heard him, no man laid hands on him; for fear came on all them that heard him; for he walked with God.",
                            "verse": 39
                        },
                        {
                            "reference": "Moses 6:40",
                            "text": "And there came a man unto him, whose name was Mahijah, and said unto him: Tell us plainly who thou art, and from whence thou comest?",
                            "verse": 40
                        },
                        {
                            "reference": "Moses 6:41",
                            "text": "And he said unto them: I came out from the land of Cainan, the land of my fathers, a land of righteousness unto this day. And my father taught me in all the ways of God.",
                            "verse": 41
                        },
                        {
                            "reference": "Moses 6:42",
                            "text": "And it came to pass, as I journeyed from the land of Cainan, by the sea east, I beheld a vision; and lo, the heavens I saw, and the Lord spake with me, and gave me commandment; wherefore, for this cause, to keep the commandment, I speak forth these words.",
                            "verse": 42
                        },
                        {
                            "reference": "Moses 6:43",
                            "text": "And Enoch continued his speech, saying: The Lord which spake with me, the same is the God of heaven, and he is my God, and your God, and ye are my brethren, and why counsel ye yourselves, and deny the God of heaven?",
                            "verse": 43
                        },
                        {
                            "reference": "Moses 6:44",
                            "text": "The heavens he made; the earth is his footstool; and the foundation thereof is his. Behold, he laid it, an host of men hath he brought in upon the face thereof.",
                            "verse": 44
                        },
                        {
                            "reference": "Moses 6:45",
                            "text": "And death hath come upon our fathers; nevertheless we know them, and cannot deny, and even the first of all we know, even Adam.",
                            "verse": 45
                        },
                        {
                            "reference": "Moses 6:46",
                            "text": "For a book of remembrance we have written among us, according to the pattern given by the finger of God; and it is given in our own language.",
                            "verse": 46
                        },
                        {
                            "reference": "Moses 6:47",
                            "text": "And as Enoch spake forth the words of God, the people trembled, and could not stand in his presence.",
                            "verse": 47
                        },
                        {
                            "reference": "Moses 6:48",
                            "text": "And he said unto them: Because that Adam fell, we are; and by his fall came death; and we are made partakers of misery and woe.",
                            "verse": 48
                        },
                        {
                            "reference": "Moses 6:49",
                            "text": "Behold Satan hath come among the children of men, and tempteth them to worship him; and men have become carnal, sensual, and devilish, and are shut out from the presence of God.",
                            "verse": 49
                        },
                        {
                            "reference": "Moses 6:50",
                            "text": "But God hath made known unto our fathers that all men must repent.",
                            "verse": 50
                        },
                        {
                            "reference": "Moses 6:51",
                            "text": "And he called upon our father Adam by his own voice, saying: I am God; I made the world, and men before they were in the flesh.",
                            "verse": 51
                        },
                        {
                            "reference": "Moses 6:52",
                            "text": "And he also said unto him: If thou wilt turn unto me, and hearken unto my voice, and believe, and repent of all thy transgressions, and be baptized, even in water, in the name of mine Only Begotten Son, who is full of grace and truth, which is Jesus Christ, the only name which shall be given under heaven, whereby salvation shall come unto the children of men, ye shall receive the gift of the Holy Ghost, asking all things in his name, and whatsoever ye shall ask, it shall be given you.",
                            "verse": 52
                        },
                        {
                            "reference": "Moses 6:53",
                            "text": "And our father Adam spake unto the Lord, and said: Why is it that men must repent and be baptized in water? And the Lord said unto Adam: Behold I have forgiven thee thy transgression in the Garden of Eden.",
                            "verse": 53
                        },
                        {
                            "reference": "Moses 6:54",
                            "text": "Hence came the saying abroad among the people, that the Son of God hath atoned for original guilt, wherein the sins of the parents cannot be answered upon the heads of the children, for they are whole from the foundation of the world.",
                            "verse": 54
                        },
                        {
                            "reference": "Moses 6:55",
                            "text": "And the Lord spake unto Adam, saying: Inasmuch as thy children are conceived in sin, even so when they begin to grow up, sin conceiveth in their hearts, and they taste the bitter, that they may know to prize the good.",
                            "verse": 55
                        },
                        {
                            "reference": "Moses 6:56",
                            "text": "And it is given unto them to know good from evil; wherefore they are agents unto themselves, and I have given unto you another law and commandment.",
                            "verse": 56
                        },
                        {
                            "reference": "Moses 6:57",
                            "text": "Wherefore teach it unto your children, that all men, everywhere, must repent, or they can in nowise inherit the kingdom of God, for no unclean thing can dwell there, or dwell in his presence; for, in the language of Adam, Man of Holiness is his name, and the name of his Only Begotten is the Son of Man, even Jesus Christ, a righteous Judge, who shall come in the meridian of time.",
                            "verse": 57
                        },
                        {
                            "reference": "Moses 6:58",
                            "text": "Therefore I give unto you a commandment, to teach these things freely unto your children, saying:",
                            "verse": 58
                        },
                        {
                            "reference": "Moses 6:59",
                            "text": "That by reason of transgression cometh the fall, which fall bringeth death, and inasmuch as ye were born into the world by water, and blood, and the spirit, which I have made, and so became of dust a living soul, even so ye must be born again into the kingdom of heaven, of water, and of the Spirit, and be cleansed by blood, even the blood of mine Only Begotten; that ye might be sanctified from all sin, and enjoy the words of eternal life in this world, and eternal life in the world to come, even immortal glory;",
                            "verse": 59
                        },
                        {
                            "reference": "Moses 6:60",
                            "text": "For by the water ye keep the commandment; by the Spirit ye are justified, and by the blood ye are sanctified;",
                            "verse": 60
                        },
                        {
                            "reference": "Moses 6:61",
                            "text": "Therefore it is given to abide in you; the record of heaven; the Comforter; the peaceable things of immortal glory; the truth of all things; that which quickeneth all things, which maketh alive all things; that which knoweth all things, and hath all power according to wisdom, mercy, truth, justice, and judgment.",
                            "verse": 61
                        },
                        {
                            "reference": "Moses 6:62",
                            "text": "And now, behold, I say unto you: This is the plan of salvation unto all men, through the blood of mine Only Begotten, who shall come in the meridian of time.",
                            "verse": 62
                        },
                        {
                            "reference": "Moses 6:63",
                            "text": "And behold, all things have their likeness, and all things are created and made to bear record of me, both things which are temporal, and things which are spiritual; things which are in the heavens above, and things which are on the earth, and things which are in the earth, and things which are under the earth, both above and beneath: all things bear record of me.",
                            "verse": 63
                        },
                        {
                            "reference": "Moses 6:64",
                            "text": "And it came to pass, when the Lord had spoken with Adam, our father, that Adam cried unto the Lord, and he was caught away by the Spirit of the Lord, and was carried down into the water, and was laid under the water, and was brought forth out of the water.",
                            "verse": 64
                        },
                        {
                            "reference": "Moses 6:65",
                            "text": "And thus he was baptized, and the Spirit of God descended upon him, and thus he was born of the Spirit, and became quickened in the inner man.",
                            "verse": 65
                        },
                        {
                            "reference": "Moses 6:66",
                            "text": "And he heard a voice out of heaven, saying: Thou art baptized with fire, and with the Holy Ghost. This is the record of the Father, and the Son, from henceforth and forever;",
                            "verse": 66
                        },
                        {
                            "reference": "Moses 6:67",
                            "text": "And thou art after the order of him who was without beginning of days or end of years, from all eternity to all eternity.",
                            "verse": 67
                        },
                        {
                            "reference": "Moses 6:68",
                            "text": "Behold, thou art one in me, a son of God; and thus may all become my sons. Amen.",
                            "verse": 68
                        }
                    ]
                },
                {
                    "chapter": 7,
                    "reference": "Moses 7",
                    "verses": [
                        {
                            "reference": "Moses 7:1",
                            "text": "And it came to pass that Enoch continued his speech, saying: Behold, our father Adam taught these things, and many have believed and become the sons of God, and many have believed not, and have perished in their sins, and are looking forth with fear, in torment, for the fiery indignation of the wrath of God to be poured out upon them.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 7:2",
                            "text": "And from that time forth Enoch began to prophesy, saying unto the people, that: As I was journeying, and stood upon the place Mahujah, and cried unto the Lord, there came a voice out of heaven, saying—Turn ye, and get ye upon the mount Simeon.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 7:3",
                            "text": "And it came to pass that I turned and went up on the mount; and as I stood upon the mount, I beheld the heavens open, and I was clothed upon with glory;",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 7:4",
                            "text": "And I saw the Lord; and he stood before my face, and he talked with me, even as a man talketh one with another, face to face; and he said unto me: Look, and I will show unto thee the world for the space of many generations.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 7:5",
                            "text": "And it came to pass that I beheld in the valley of Shum, and lo, a great people which dwelt in tents, which were the people of Shum.",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 7:6",
                            "text": "And again the Lord said unto me: Look; and I looked towards the north, and I beheld the people of Canaan, which dwelt in tents.",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 7:7",
                            "text": "And the Lord said unto me: Prophesy; and I prophesied, saying: Behold the people of Canaan, which are numerous, shall go forth in battle array against the people of Shum, and shall slay them that they shall utterly be destroyed; and the people of Canaan shall divide themselves in the land, and the land shall be barren and unfruitful, and none other people shall dwell there but the people of Canaan;",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 7:8",
                            "text": "For behold, the Lord shall curse the land with much heat, and the barrenness thereof shall go forth forever; and there was a blackness came upon all the children of Canaan, that they were despised among all people.",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 7:9",
                            "text": "And it came to pass that the Lord said unto me: Look; and I looked, and I beheld the land of Sharon, and the land of Enoch, and the land of Omner, and the land of Heni, and the land of Shem, and the land of Haner, and the land of Hanannihah, and all the inhabitants thereof;",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 7:10",
                            "text": "And the Lord said unto me: Go to this people, and say unto them—Repent, lest I come out and smite them with a curse, and they die.",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 7:11",
                            "text": "And he gave unto me a commandment that I should baptize in the name of the Father, and of the Son, which is full of grace and truth, and of the Holy Ghost, which beareth record of the Father and the Son.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 7:12",
                            "text": "And it came to pass that Enoch continued to call upon all the people, save it were the people of Canaan, to repent;",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 7:13",
                            "text": "And so great was the faith of Enoch that he led the people of God, and their enemies came to battle against them; and he spake the word of the Lord, and the earth trembled, and the mountains fled, even according to his command; and the rivers of water were turned out of their course; and the roar of the lions was heard out of the wilderness; and all nations feared greatly, so powerful was the word of Enoch, and so great was the power of the language which God had given him.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 7:14",
                            "text": "There also came up a land out of the depth of the sea, and so great was the fear of the enemies of the people of God, that they fled and stood afar off and went upon the land which came up out of the depth of the sea.",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 7:15",
                            "text": "And the giants of the land, also, stood afar off; and there went forth a curse upon all people that fought against God;",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 7:16",
                            "text": "And from that time forth there were wars and bloodshed among them; but the Lord came and dwelt with his people, and they dwelt in righteousness.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 7:17",
                            "text": "The fear of the Lord was upon all nations, so great was the glory of the Lord, which was upon his people. And the Lord blessed the land, and they were blessed upon the mountains, and upon the high places, and did flourish.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 7:18",
                            "text": "And the Lord called his people ZION, because they were of one heart and one mind, and dwelt in righteousness; and there was no poor among them.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 7:19",
                            "text": "And Enoch continued his preaching in righteousness unto the people of God. And it came to pass in his days, that he built a city that was called the City of Holiness, even ZION.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 7:20",
                            "text": "And it came to pass that Enoch talked with the Lord; and he said unto the Lord: Surely Zion shall dwell in safety forever. But the Lord said unto Enoch: Zion have I blessed, but the residue of the people have I cursed.",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 7:21",
                            "text": "And it came to pass that the Lord showed unto Enoch all the inhabitants of the earth; and he beheld, and lo, Zion, in process of time, was taken up into heaven. And the Lord said unto Enoch: Behold mine abode forever.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 7:22",
                            "text": "And Enoch also beheld the residue of the people which were the sons of Adam; and they were a mixture of all the seed of Adam save it was the seed of Cain, for the seed of Cain were black, and had not place among them.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 7:23",
                            "text": "And after that Zion was taken up into heaven, Enoch beheld, and lo, all the nations of the earth were before him;",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 7:24",
                            "text": "And there came generation upon generation; and Enoch was high and lifted up, even in the bosom of the Father, and of the Son of Man; and behold, the power of Satan was upon all the face of the earth.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 7:25",
                            "text": "And he saw angels descending out of heaven; and he heard a loud voice saying: Wo, wo be unto the inhabitants of the earth.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 7:26",
                            "text": "And he beheld Satan; and he had a great chain in his hand, and it veiled the whole face of the earth with darkness; and he looked up and laughed, and his angels rejoiced.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 7:27",
                            "text": "And Enoch beheld angels descending out of heaven, bearing testimony of the Father and Son; and the Holy Ghost fell on many, and they were caught up by the powers of heaven into Zion.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 7:28",
                            "text": "And it came to pass that the God of heaven looked upon the residue of the people, and he wept; and Enoch bore record of it, saying: How is it that the heavens weep, and shed forth their tears as the rain upon the mountains?",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 7:29",
                            "text": "And Enoch said unto the Lord: How is it that thou canst weep, seeing thou art holy, and from all eternity to all eternity?",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 7:30",
                            "text": "And were it possible that man could number the particles of the earth, yea, millions of earths like this, it would not be a beginning to the number of thy creations; and thy curtains are stretched out still; and yet thou art there, and thy bosom is there; and also thou art just; thou art merciful and kind forever;",
                            "verse": 30
                        },
                        {
                            "reference": "Moses 7:31",
                            "text": "And thou hast taken Zion to thine own bosom, from all thy creations, from all eternity to all eternity; and naught but peace, justice, and truth is the habitation of thy throne; and mercy shall go before thy face and have no end; how is it thou canst weep?",
                            "verse": 31
                        },
                        {
                            "reference": "Moses 7:32",
                            "text": "The Lord said unto Enoch: Behold these thy brethren; they are the workmanship of mine own hands, and I gave unto them their knowledge, in the day I created them; and in the Garden of Eden, gave I unto man his agency;",
                            "verse": 32
                        },
                        {
                            "reference": "Moses 7:33",
                            "text": "And unto thy brethren have I said, and also given commandment, that they should love one another, and that they should choose me, their Father; but behold, they are without affection, and they hate their own blood;",
                            "verse": 33
                        },
                        {
                            "reference": "Moses 7:34",
                            "text": "And the fire of mine indignation is kindled against them; and in my hot displeasure will I send in the floods upon them, for my fierce anger is kindled against them.",
                            "verse": 34
                        },
                        {
                            "reference": "Moses 7:35",
                            "text": "Behold, I am God; Man of Holiness is my name; Man of Counsel is my name; and Endless and Eternal is my name, also.",
                            "verse": 35
                        },
                        {
                            "reference": "Moses 7:36",
                            "text": "Wherefore, I can stretch forth mine hands and hold all the creations which I have made; and mine eye can pierce them also, and among all the workmanship of mine hands there has not been so great wickedness as among thy brethren.",
                            "verse": 36
                        },
                        {
                            "reference": "Moses 7:37",
                            "text": "But behold, their sins shall be upon the heads of their fathers; Satan shall be their father, and misery shall be their doom; and the whole heavens shall weep over them, even all the workmanship of mine hands; wherefore should not the heavens weep, seeing these shall suffer?",
                            "verse": 37
                        },
                        {
                            "reference": "Moses 7:38",
                            "text": "But behold, these which thine eyes are upon shall perish in the floods; and behold, I will shut them up; a prison have I prepared for them.",
                            "verse": 38
                        },
                        {
                            "reference": "Moses 7:39",
                            "text": "And that which I have chosen hath pled before my face. Wherefore, he suffereth for their sins; inasmuch as they will repent in the day that my Chosen shall return unto me, and until that day they shall be in torment;",
                            "verse": 39
                        },
                        {
                            "reference": "Moses 7:40",
                            "text": "Wherefore, for this shall the heavens weep, yea, and all the workmanship of mine hands.",
                            "verse": 40
                        },
                        {
                            "reference": "Moses 7:41",
                            "text": "And it came to pass that the Lord spake unto Enoch, and told Enoch all the doings of the children of men; wherefore Enoch knew, and looked upon their wickedness, and their misery, and wept and stretched forth his arms, and his heart swelled wide as eternity; and his bowels yearned; and all eternity shook.",
                            "verse": 41
                        },
                        {
                            "reference": "Moses 7:42",
                            "text": "And Enoch also saw Noah, and his family; that the posterity of all the sons of Noah should be saved with a temporal salvation;",
                            "verse": 42
                        },
                        {
                            "reference": "Moses 7:43",
                            "text": "Wherefore Enoch saw that Noah built an ark; and that the Lord smiled upon it, and held it in his own hand; but upon the residue of the wicked the floods came and swallowed them up.",
                            "verse": 43
                        },
                        {
                            "reference": "Moses 7:44",
                            "text": "And as Enoch saw this, he had bitterness of soul, and wept over his brethren, and said unto the heavens: I will refuse to be comforted; but the Lord said unto Enoch: Lift up your heart, and be glad; and look.",
                            "verse": 44
                        },
                        {
                            "reference": "Moses 7:45",
                            "text": "And it came to pass that Enoch looked; and from Noah, he beheld all the families of the earth; and he cried unto the Lord, saying: When shall the day of the Lord come? When shall the blood of the Righteous be shed, that all they that mourn may be sanctified and have eternal life?",
                            "verse": 45
                        },
                        {
                            "reference": "Moses 7:46",
                            "text": "And the Lord said: It shall be in the meridian of time, in the days of wickedness and vengeance.",
                            "verse": 46
                        },
                        {
                            "reference": "Moses 7:47",
                            "text": "And behold, Enoch saw the day of the coming of the Son of Man, even in the flesh; and his soul rejoiced, saying: The Righteous is lifted up, and the Lamb is slain from the foundation of the world; and through faith I am in the bosom of the Father, and behold, Zion is with me.",
                            "verse": 47
                        },
                        {
                            "reference": "Moses 7:48",
                            "text": "And it came to pass that Enoch looked upon the earth; and he heard a voice from the bowels thereof, saying: Wo, wo is me, the mother of men; I am pained, I am weary, because of the wickedness of my children. When shall I rest, and be cleansed from the filthiness which is gone forth out of me? When will my Creator sanctify me, that I may rest, and righteousness for a season abide upon my face?",
                            "verse": 48
                        },
                        {
                            "reference": "Moses 7:49",
                            "text": "And when Enoch heard the earth mourn, he wept, and cried unto the Lord, saying: O Lord, wilt thou not have compassion upon the earth? Wilt thou not bless the children of Noah?",
                            "verse": 49
                        },
                        {
                            "reference": "Moses 7:50",
                            "text": "And it came to pass that Enoch continued his cry unto the Lord, saying: I ask thee, O Lord, in the name of thine Only Begotten, even Jesus Christ, that thou wilt have mercy upon Noah and his seed, that the earth might never more be covered by the floods.",
                            "verse": 50
                        },
                        {
                            "reference": "Moses 7:51",
                            "text": "And the Lord could not withhold; and he covenanted with Enoch, and sware unto him with an oath, that he would stay the floods; that he would call upon the children of Noah;",
                            "verse": 51
                        },
                        {
                            "reference": "Moses 7:52",
                            "text": "And he sent forth an unalterable decree, that a remnant of his seed should always be found among all nations, while the earth should stand;",
                            "verse": 52
                        },
                        {
                            "reference": "Moses 7:53",
                            "text": "And the Lord said: Blessed is he through whose seed Messiah shall come; for he saith—I am Messiah, the King of Zion, the Rock of Heaven, which is broad as eternity; whoso cometh in at the gate and climbeth up by me shall never fall; wherefore, blessed are they of whom I have spoken, for they shall come forth with songs of everlasting joy.",
                            "verse": 53
                        },
                        {
                            "reference": "Moses 7:54",
                            "text": "And it came to pass that Enoch cried unto the Lord, saying: When the Son of Man cometh in the flesh, shall the earth rest? I pray thee, show me these things.",
                            "verse": 54
                        },
                        {
                            "reference": "Moses 7:55",
                            "text": "And the Lord said unto Enoch: Look, and he looked and beheld the Son of Man lifted up on the cross, after the manner of men;",
                            "verse": 55
                        },
                        {
                            "reference": "Moses 7:56",
                            "text": "And he heard a loud voice; and the heavens were veiled; and all the creations of God mourned; and the earth groaned; and the rocks were rent; and the saints arose, and were crowned at the right hand of the Son of Man, with crowns of glory;",
                            "verse": 56
                        },
                        {
                            "reference": "Moses 7:57",
                            "text": "And as many of the spirits as were in prison came forth, and stood on the right hand of God; and the remainder were reserved in chains of darkness until the judgment of the great day.",
                            "verse": 57
                        },
                        {
                            "reference": "Moses 7:58",
                            "text": "And again Enoch wept and cried unto the Lord, saying: When shall the earth rest?",
                            "verse": 58
                        },
                        {
                            "reference": "Moses 7:59",
                            "text": "And Enoch beheld the Son of Man ascend up unto the Father; and he called unto the Lord, saying: Wilt thou not come again upon the earth? Forasmuch as thou art God, and I know thee, and thou hast sworn unto me, and commanded me that I should ask in the name of thine Only Begotten; thou hast made me, and given unto me a right to thy throne, and not of myself, but through thine own grace; wherefore, I ask thee if thou wilt not come again on the earth.",
                            "verse": 59
                        },
                        {
                            "reference": "Moses 7:60",
                            "text": "And the Lord said unto Enoch: As I live, even so will I come in the last days, in the days of wickedness and vengeance, to fulfil the oath which I have made unto you concerning the children of Noah;",
                            "verse": 60
                        },
                        {
                            "reference": "Moses 7:61",
                            "text": "And the day shall come that the earth shall rest, but before that day the heavens shall be darkened, and a veil of darkness shall cover the earth; and the heavens shall shake, and also the earth; and great tribulations shall be among the children of men, but my people will I preserve;",
                            "verse": 61
                        },
                        {
                            "reference": "Moses 7:62",
                            "text": "And righteousness will I send down out of heaven; and truth will I send forth out of the earth, to bear testimony of mine Only Begotten; his resurrection from the dead; yea, and also the resurrection of all men; and righteousness and truth will I cause to sweep the earth as with a flood, to gather out mine elect from the four quarters of the earth, unto a place which I shall prepare, an Holy City, that my people may gird up their loins, and be looking forth for the time of my coming; for there shall be my tabernacle, and it shall be called Zion, a New Jerusalem.",
                            "verse": 62
                        },
                        {
                            "reference": "Moses 7:63",
                            "text": "And the Lord said unto Enoch: Then shalt thou and all thy city meet them there, and we will receive them into our bosom, and they shall see us; and we will fall upon their necks, and they shall fall upon our necks, and we will kiss each other;",
                            "verse": 63
                        },
                        {
                            "reference": "Moses 7:64",
                            "text": "And there shall be mine abode, and it shall be Zion, which shall come forth out of all the creations which I have made; and for the space of a thousand years the earth shall rest.",
                            "verse": 64
                        },
                        {
                            "reference": "Moses 7:65",
                            "text": "And it came to pass that Enoch saw the day of the coming of the Son of Man, in the last days, to dwell on the earth in righteousness for the space of a thousand years;",
                            "verse": 65
                        },
                        {
                            "reference": "Moses 7:66",
                            "text": "But before that day he saw great tribulations among the wicked; and he also saw the sea, that it was troubled, and men's hearts failing them, looking forth with fear for the judgments of the Almighty God, which should come upon the wicked.",
                            "verse": 66
                        },
                        {
                            "reference": "Moses 7:67",
                            "text": "And the Lord showed Enoch all things, even unto the end of the world; and he saw the day of the righteous, the hour of their redemption, and received a fulness of joy;",
                            "verse": 67
                        },
                        {
                            "reference": "Moses 7:68",
                            "text": "And all the days of Zion, in the days of Enoch, were three hundred and sixty-five years.",
                            "verse": 68
                        },
                        {
                            "reference": "Moses 7:69",
                            "text": "And Enoch and all his people walked with God, and he dwelt in the midst of Zion; and it came to pass that Zion was not, for God received it up into his own bosom; and from thence went forth the saying, ZION IS FLED.",
                            "verse": 69
                        }
                    ]
                },
                {
                    "chapter": 8,
                    "reference": "Moses 8",
                    "verses": [
                        {
                            "reference": "Moses 8:1",
                            "text": "And all the days of Enoch were four hundred and thirty years.",
                            "verse": 1
                        },
                        {
                            "reference": "Moses 8:2",
                            "text": "And it came to pass that Methuselah, the son of Enoch, was not taken, that the covenants of the Lord might be fulfilled, which he made to Enoch; for he truly covenanted with Enoch that Noah should be of the fruit of his loins.",
                            "verse": 2
                        },
                        {
                            "reference": "Moses 8:3",
                            "text": "And it came to pass that Methuselah prophesied that from his loins should spring all the kingdoms of the earth (through Noah), and he took glory unto himself.",
                            "verse": 3
                        },
                        {
                            "reference": "Moses 8:4",
                            "text": "And there came forth a great famine into the land, and the Lord cursed the earth with a sore curse, and many of the inhabitants thereof died.",
                            "verse": 4
                        },
                        {
                            "reference": "Moses 8:5",
                            "text": "And it came to pass that Methuselah lived one hundred and eighty-seven years, and begat Lamech;",
                            "verse": 5
                        },
                        {
                            "reference": "Moses 8:6",
                            "text": "And Methuselah lived, after he begat Lamech, seven hundred and eighty-two years, and begat sons and daughters;",
                            "verse": 6
                        },
                        {
                            "reference": "Moses 8:7",
                            "text": "And all the days of Methuselah were nine hundred and sixty-nine years, and he died.",
                            "verse": 7
                        },
                        {
                            "reference": "Moses 8:8",
                            "text": "And Lamech lived one hundred and eighty-two years, and begat a son,",
                            "verse": 8
                        },
                        {
                            "reference": "Moses 8:9",
                            "text": "And he called his name Noah, saying: This son shall comfort us concerning our work and toil of our hands, because of the ground which the Lord hath cursed.",
                            "verse": 9
                        },
                        {
                            "reference": "Moses 8:10",
                            "text": "And Lamech lived, after he begat Noah, five hundred and ninety-five years, and begat sons and daughters;",
                            "verse": 10
                        },
                        {
                            "reference": "Moses 8:11",
                            "text": "And all the days of Lamech were seven hundred and seventy-seven years, and he died.",
                            "verse": 11
                        },
                        {
                            "reference": "Moses 8:12",
                            "text": "And Noah was four hundred and fifty years old, and begat Japheth; and forty-two years afterward he begat Shem of her who was the mother of Japheth, and when he was five hundred years old he begat Ham.",
                            "verse": 12
                        },
                        {
                            "reference": "Moses 8:13",
                            "text": "And Noah and his sons hearkened unto the Lord, and gave heed, and they were called the sons of God.",
                            "verse": 13
                        },
                        {
                            "reference": "Moses 8:14",
                            "text": "And when these men began to multiply on the face of the earth, and daughters were born unto them, the sons of men saw that those daughters were fair, and they took them wives, even as they chose.",
                            "verse": 14
                        },
                        {
                            "reference": "Moses 8:15",
                            "text": "And the Lord said unto Noah: The daughters of thy sons have sold themselves; for behold mine anger is kindled against the sons of men, for they will not hearken to my voice.",
                            "verse": 15
                        },
                        {
                            "reference": "Moses 8:16",
                            "text": "And it came to pass that Noah prophesied, and taught the things of God, even as it was in the beginning.",
                            "verse": 16
                        },
                        {
                            "reference": "Moses 8:17",
                            "text": "And the Lord said unto Noah: My Spirit shall not always strive with man, for he shall know that all flesh shall die; yet his days shall be an hundred and twenty years; and if men do not repent, I will send in the floods upon them.",
                            "verse": 17
                        },
                        {
                            "reference": "Moses 8:18",
                            "text": "And in those days there were giants on the earth, and they sought Noah to take away his life; but the Lord was with Noah, and the power of the Lord was upon him.",
                            "verse": 18
                        },
                        {
                            "reference": "Moses 8:19",
                            "text": "And the Lord ordained Noah after his own order, and commanded him that he should go forth and declare his Gospel unto the children of men, even as it was given unto Enoch.",
                            "verse": 19
                        },
                        {
                            "reference": "Moses 8:20",
                            "text": "And it came to pass that Noah called upon the children of men that they should repent; but they hearkened not unto his words;",
                            "verse": 20
                        },
                        {
                            "reference": "Moses 8:21",
                            "text": "And also, after that they had heard him, they came up before him, saying: Behold, we are the sons of God; have we not taken unto ourselves the daughters of men? And are we not eating and drinking, and marrying and giving in marriage? And our wives bear unto us children, and the same are mighty men, which are like unto men of old, men of great renown. And they hearkened not unto the words of Noah.",
                            "verse": 21
                        },
                        {
                            "reference": "Moses 8:22",
                            "text": "And God saw that the wickedness of men had become great in the earth; and every man was lifted up in the imagination of the thoughts of his heart, being only evil continually.",
                            "verse": 22
                        },
                        {
                            "reference": "Moses 8:23",
                            "text": "And it came to pass that Noah continued his preaching unto the people, saying: Hearken, and give heed unto my words;",
                            "verse": 23
                        },
                        {
                            "reference": "Moses 8:24",
                            "text": "Believe and repent of your sins and be baptized in the name of Jesus Christ, the Son of God, even as our fathers, and ye shall receive the Holy Ghost, that ye may have all things made manifest; and if ye do not this, the floods will come in upon you; nevertheless they hearkened not.",
                            "verse": 24
                        },
                        {
                            "reference": "Moses 8:25",
                            "text": "And it repented Noah, and his heart was pained that the Lord had made man on the earth, and it grieved him at the heart.",
                            "verse": 25
                        },
                        {
                            "reference": "Moses 8:26",
                            "text": "And the Lord said: I will destroy man whom I have created, from the face of the earth, both man and beast, and the creeping things, and the fowls of the air; for it repenteth Noah that I have created them, and that I have made them; and he hath called upon me; for they have sought his life.",
                            "verse": 26
                        },
                        {
                            "reference": "Moses 8:27",
                            "text": "And thus Noah found grace in the eyes of the Lord; for Noah was a just man, and perfect in his generation; and he walked with God, as did also his three sons, Shem, Ham, and Japheth.",
                            "verse": 27
                        },
                        {
                            "reference": "Moses 8:28",
                            "text": "The earth was corrupt before God, and it was filled with violence.",
                            "verse": 28
                        },
                        {
                            "reference": "Moses 8:29",
                            "text": "And God looked upon the earth, and, behold, it was corrupt, for all flesh had corrupted its way upon the earth.",
                            "verse": 29
                        },
                        {
                            "reference": "Moses 8:30",
                            "text": "And God said unto Noah: The end of all flesh is come before me, for the earth is filled with violence, and behold I will destroy all flesh from off the earth.",
                            "verse": 30
                        }
                    ]
                }
            ],
			"full_title": "Selections from the Book of Moses",
            "lds_slug": "moses"
        },
        {
            "book": "Abraham",
            "chapters": [
                {
                    "chapter": 1,
                    "reference": "Abraham 1",
                    "verses": [
                        {
                            "reference": "Abraham 1:1",
                            "text": "In the land of the Chaldeans, at the residence of my fathers, I, Abraham, saw that it was needful for me to obtain another place of residence;",
                            "verse": 1
                        },
                        {
                            "reference": "Abraham 1:2",
                            "text": "And, finding there was greater happiness and peace and rest for me, I sought for the blessings of the fathers, and the right whereunto I should be ordained to administer the same; having been myself a follower of righteousness, desiring also to be one who possessed great knowledge, and to be a greater follower of righteousness, and to possess a greater knowledge, and to be a father of many nations, a prince of peace, and desiring to receive instructions, and to keep the commandments of God, I became a rightful heir, a High Priest, holding the right belonging to the fathers.",
                            "verse": 2
                        },
                        {
                            "reference": "Abraham 1:3",
                            "text": "It was conferred upon me from the fathers; it came down from the fathers, from the beginning of time, yea, even from the beginning, or before the foundation of the earth, down to the present time, even the right of the firstborn, or the first man, who is Adam, or first father, through the fathers unto me.",
                            "verse": 3
                        },
                        {
                            "reference": "Abraham 1:4",
                            "text": "I sought for mine appointment unto the Priesthood according to the appointment of God unto the fathers concerning the seed.",
                            "verse": 4
                        },
                        {
                            "reference": "Abraham 1:5",
                            "text": "My fathers, having turned from their righteousness, and from the holy commandments which the Lord their God had given unto them, unto the worshiping of the gods of the heathen, utterly refused to hearken to my voice;",
                            "verse": 5
                        },
                        {
                            "reference": "Abraham 1:6",
                            "text": "For their hearts were set to do evil, and were wholly turned to the god of Elkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt;",
                            "verse": 6
                        },
                        {
                            "reference": "Abraham 1:7",
                            "text": "Therefore they turned their hearts to the sacrifice of the heathen in offering up their children unto these dumb idols, and hearkened not unto my voice, but endeavored to take away my life by the hand of the priest of Elkenah. The priest of Elkenah was also the priest of Pharaoh.",
                            "verse": 7
                        },
                        {
                            "reference": "Abraham 1:8",
                            "text": "Now, at this time it was the custom of the priest of Pharaoh, the king of Egypt, to offer up upon the altar which was built in the land of Chaldea, for the offering unto these strange gods, men, women, and children.",
                            "verse": 8
                        },
                        {
                            "reference": "Abraham 1:9",
                            "text": "And it came to pass that the priest made an offering unto the god of Pharaoh, and also unto the god of Shagreel, even after the manner of the Egyptians. Now the god of Shagreel was the sun.",
                            "verse": 9
                        },
                        {
                            "reference": "Abraham 1:10",
                            "text": "Even the thank-offering of a child did the priest of Pharaoh offer upon the altar which stood by the hill called Potiphar's Hill, at the head of the plain of Olishem.",
                            "verse": 10
                        },
                        {
                            "reference": "Abraham 1:11",
                            "text": "Now, this priest had offered upon this altar three virgins at one time, who were the daughters of Onitah, one of the royal descent directly from the loins of Ham. These virgins were offered up because of their virtue; they would not bow down to worship gods of wood or of stone, therefore they were killed upon this altar, and it was done after the manner of the Egyptians.",
                            "verse": 11
                        },
                        {
                            "reference": "Abraham 1:12",
                            "text": "And it came to pass that the priests laid violence upon me, that they might slay me also, as they did those virgins upon this altar; and that you may have a knowledge of this altar, I will refer you to the representation at the commencement of this record.",
                            "verse": 12
                        },
                        {
                            "reference": "Abraham 1:13",
                            "text": "It was made after the form of a bedstead, such as was had among the Chaldeans, and it stood before the gods of Elkenah, Libnah, Mahmackrah, Korash, and also a god like unto that of Pharaoh, king of Egypt.",
                            "verse": 13
                        },
                        {
                            "reference": "Abraham 1:14",
                            "text": "That you may have an understanding of these gods, I have given you the fashion of them in the figures at the beginning, which manner of figures is called by the Chaldeans Rahleenos, which signifies hieroglyphics.",
                            "verse": 14
                        },
                        {
                            "reference": "Abraham 1:15",
                            "text": "And as they lifted up their hands upon me, that they might offer me up and take away my life, behold, I lifted up my voice unto the Lord my God, and the Lord hearkened and heard, and he filled me with the vision of the Almighty, and the angel of his presence stood by me, and immediately unloosed my bands;",
                            "verse": 15
                        },
                        {
                            "reference": "Abraham 1:16",
                            "text": "And his voice was unto me: Abraham, Abraham, behold, my name is Jehovah, and I have heard thee, and have come down to deliver thee, and to take thee away from thy father's house, and from all thy kinsfolk, into a strange land which thou knowest not of;",
                            "verse": 16
                        },
                        {
                            "reference": "Abraham 1:17",
                            "text": "And this because they have turned their hearts away from me, to worship the god of Elkenah, and the god of Libnah, and the god of Mahmackrah, and the god of Korash, and the god of Pharaoh, king of Egypt; therefore I have come down to visit them, and to destroy him who hath lifted up his hand against thee, Abraham, my son, to take away thy life.",
                            "verse": 17
                        },
                        {
                            "reference": "Abraham 1:18",
                            "text": "Behold, I will lead thee by my hand, and I will take thee, to put upon thee my name, even the Priesthood of thy father, and my power shall be over thee.",
                            "verse": 18
                        },
                        {
                            "reference": "Abraham 1:19",
                            "text": "As it was with Noah so shall it be with thee; but through thy ministry my name shall be known in the earth forever, for I am thy God.",
                            "verse": 19
                        },
                        {
                            "reference": "Abraham 1:20",
                            "text": "Behold, Potiphar's Hill was in the land of Ur, of Chaldea. And the Lord broke down the altar of Elkenah, and of the gods of the land, and utterly destroyed them, and smote the priest that he died; and there was great mourning in Chaldea, and also in the court of Pharaoh; which Pharaoh signifies king by royal blood.",
                            "verse": 20
                        },
                        {
                            "reference": "Abraham 1:21",
                            "text": "Now this king of Egypt was a descendant from the loins of Ham, and was a partaker of the blood of the Canaanites by birth.",
                            "verse": 21
                        },
                        {
                            "reference": "Abraham 1:22",
                            "text": "From this descent sprang all the Egyptians, and thus the blood of the Canaanites was preserved in the land.",
                            "verse": 22
                        },
                        {
                            "reference": "Abraham 1:23",
                            "text": "The land of Egypt being first discovered by a woman, who was the daughter of Ham, and the daughter of Egyptus, which in the Chaldean signifies Egypt, which signifies that which is forbidden;",
                            "verse": 23
                        },
                        {
                            "reference": "Abraham 1:24",
                            "text": "When this woman discovered the land it was under water, who afterward settled her sons in it; and thus, from Ham, sprang that race which preserved the curse in the land.",
                            "verse": 24
                        },
                        {
                            "reference": "Abraham 1:25",
                            "text": "Now the first government of Egypt was established by Pharaoh, the eldest son of Egyptus, the daughter of Ham, and it was after the manner of the government of Ham, which was patriarchal.",
                            "verse": 25
                        },
                        {
                            "reference": "Abraham 1:26",
                            "text": "Pharaoh, being a righteous man, established his kingdom and judged his people wisely and justly all his days, seeking earnestly to imitate that order established by the fathers in the first generations, in the days of the first patriarchal reign, even in the reign of Adam, and also of Noah, his father, who blessed him with the blessings of the earth, and with the blessings of wisdom, but cursed him as pertaining to the Priesthood.",
                            "verse": 26
                        },
                        {
                            "reference": "Abraham 1:27",
                            "text": "Now, Pharaoh being of that lineage by which he could not have the right of Priesthood, notwithstanding the Pharaohs would fain claim it from Noah, through Ham, therefore my father was led away by their idolatry;",
                            "verse": 27
                        },
                        {
                            "reference": "Abraham 1:28",
                            "text": "But I shall endeavor, hereafter, to delineate the chronology running back from myself to the beginning of the creation, for the records have come into my hands, which I hold unto this present time.",
                            "verse": 28
                        },
                        {
                            "reference": "Abraham 1:29",
                            "text": "Now, after the priest of Elkenah was smitten that he died, there came a fulfilment of those things which were said unto me concerning the land of Chaldea, that there should be a famine in the land.",
                            "verse": 29
                        },
                        {
                            "reference": "Abraham 1:30",
                            "text": "Accordingly a famine prevailed throughout all the land of Chaldea, and my father was sorely tormented because of the famine, and he repented of the evil which he had determined against me, to take away my life.",
                            "verse": 30
                        },
                        {
                            "reference": "Abraham 1:31",
                            "text": "But the records of the fathers, even the patriarchs, concerning the right of Priesthood, the Lord my God preserved in mine own hands; therefore a knowledge of the beginning of the creation, and also of the planets, and of the stars, as they were made known unto the fathers, have I kept even unto this day, and I shall endeavor to write some of these things upon this record, for the benefit of my posterity that shall come after me.",
                            "verse": 31
                        }
                    ]
                },
                {
                    "chapter": 2,
                    "reference": "Abraham 2",
                    "verses": [
                        {
                            "reference": "Abraham 2:1",
                            "text": "Now the Lord God caused the famine to wax sore in the land of Ur, insomuch that Haran, my brother, died; but Terah, my father, yet lived in the land of Ur, of the Chaldees.",
                            "verse": 1
                        },
                        {
                            "reference": "Abraham 2:2",
                            "text": "And it came to pass that I, Abraham, took Sarai to wife, and Nahor, my brother, took Milcah to wife, who was the daughter of Haran.",
                            "verse": 2
                        },
                        {
                            "reference": "Abraham 2:3",
                            "text": "Now the Lord had said unto me: Abraham, get thee out of thy country, and from thy kindred, and from thy father's house, unto a land that I will show thee.",
                            "verse": 3
                        },
                        {
                            "reference": "Abraham 2:4",
                            "text": "Therefore I left the land of Ur, of the Chaldees, to go into the land of Canaan; and I took Lot, my brother's son, and his wife, and Sarai my wife; and also my father followed after me, unto the land which we denominated Haran.",
                            "verse": 4
                        },
                        {
                            "reference": "Abraham 2:5",
                            "text": "And the famine abated; and my father tarried in Haran and dwelt there, as there were many flocks in Haran; and my father turned again unto his idolatry, therefore he continued in Haran.",
                            "verse": 5
                        },
                        {
                            "reference": "Abraham 2:6",
                            "text": "But I, Abraham, and Lot, my brother's son, prayed unto the Lord, and the Lord appeared unto me, and said unto me: Arise, and take Lot with thee; for I have purposed to take thee away out of Haran, and to make of thee a minister to bear my name in a strange land which I will give unto thy seed after thee for an everlasting possession, when they hearken to my voice.",
                            "verse": 6
                        },
                        {
                            "reference": "Abraham 2:7",
                            "text": "For I am the Lord thy God; I dwell in heaven; the earth is my footstool; I stretch my hand over the sea, and it obeys my voice; I cause the wind and the fire to be my chariot; I say to the mountains—Depart hence—and behold, they are taken away by a whirlwind, in an instant, suddenly.",
                            "verse": 7
                        },
                        {
                            "reference": "Abraham 2:8",
                            "text": "My name is Jehovah, and I know the end from the beginning; therefore my hand shall be over thee.",
                            "verse": 8
                        },
                        {
                            "reference": "Abraham 2:9",
                            "text": "And I will make of thee a great nation, and I will bless thee above measure, and make thy name great among all nations, and thou shalt be a blessing unto thy seed after thee, that in their hands they shall bear this ministry and Priesthood unto all nations;",
                            "verse": 9
                        },
                        {
                            "reference": "Abraham 2:10",
                            "text": "And I will bless them through thy name; for as many as receive this Gospel shall be called after thy name, and shall be accounted thy seed, and shall rise up and bless thee, as their father;",
                            "verse": 10
                        },
                        {
                            "reference": "Abraham 2:11",
                            "text": "And I will bless them that bless thee, and curse them that curse thee; and in thee (that is, in thy Priesthood) and in thy seed (that is, thy Priesthood), for I give unto thee a promise that this right shall continue in thee, and in thy seed after thee (that is to say, the literal seed, or the seed of the body) shall all the families of the earth be blessed, even with the blessings of the Gospel, which are the blessings of salvation, even of life eternal.",
                            "verse": 11
                        },
                        {
                            "reference": "Abraham 2:12",
                            "text": "Now, after the Lord had withdrawn from speaking to me, and withdrawn his face from me, I said in my heart: Thy servant has sought thee earnestly; now I have found thee;",
                            "verse": 12
                        },
                        {
                            "reference": "Abraham 2:13",
                            "text": "Thou didst send thine angel to deliver me from the gods of Elkenah, and I will do well to hearken unto thy voice, therefore let thy servant rise up and depart in peace.",
                            "verse": 13
                        },
                        {
                            "reference": "Abraham 2:14",
                            "text": "So I, Abraham, departed as the Lord had said unto me, and Lot with me; and I, Abraham, was sixty and two years old when I departed out of Haran.",
                            "verse": 14
                        },
                        {
                            "reference": "Abraham 2:15",
                            "text": "And I took Sarai, whom I took to wife when I was in Ur, in Chaldea, and Lot, my brother's son, and all our substance that we had gathered, and the souls that we had won in Haran, and came forth in the way to the land of Canaan, and dwelt in tents as we came on our way;",
                            "verse": 15
                        },
                        {
                            "reference": "Abraham 2:16",
                            "text": "Therefore, eternity was our covering and our rock and our salvation, as we journeyed from Haran by the way of Jershon, to come to the land of Canaan.",
                            "verse": 16
                        },
                        {
                            "reference": "Abraham 2:17",
                            "text": "Now I, Abraham, built an altar in the land of Jershon, and made an offering unto the Lord, and prayed that the famine might be turned away from my father's house, that they might not perish.",
                            "verse": 17
                        },
                        {
                            "reference": "Abraham 2:18",
                            "text": "And then we passed from Jershon through the land unto the place of Sechem; it was situated in the plains of Moreh, and we had already come into the borders of the land of the Canaanites, and I offered sacrifice there in the plains of Moreh, and called on the Lord devoutly, because we had already come into the land of this idolatrous nation.",
                            "verse": 18
                        },
                        {
                            "reference": "Abraham 2:19",
                            "text": "And the Lord appeared unto me in answer to my prayers, and said unto me: Unto thy seed will I give this land.",
                            "verse": 19
                        },
                        {
                            "reference": "Abraham 2:20",
                            "text": "And I, Abraham, arose from the place of the altar which I had built unto the Lord, and removed from thence unto a mountain on the east of Bethel, and pitched my tent there, Bethel on the west, and Hai on the east; and there I built another altar unto the Lord, and called again upon the name of the Lord.",
                            "verse": 20
                        },
                        {
                            "reference": "Abraham 2:21",
                            "text": "And I, Abraham, journeyed, going on still towards the south; and there was a continuation of a famine in the land; and I, Abraham, concluded to go down into Egypt, to sojourn there, for the famine became very grievous.",
                            "verse": 21
                        },
                        {
                            "reference": "Abraham 2:22",
                            "text": "And it came to pass when I was come near to enter into Egypt, the Lord said unto me: Behold, Sarai, thy wife, is a very fair woman to look upon;",
                            "verse": 22
                        },
                        {
                            "reference": "Abraham 2:23",
                            "text": "Therefore it shall come to pass, when the Egyptians shall see her, they will say—She is his wife; and they will kill you, but they will save her alive; therefore see that ye do on this wise:",
                            "verse": 23
                        },
                        {
                            "reference": "Abraham 2:24",
                            "text": "Let her say unto the Egyptians, she is thy sister, and thy soul shall live.",
                            "verse": 24
                        },
                        {
                            "reference": "Abraham 2:25",
                            "text": "And it came to pass that I, Abraham, told Sarai, my wife, all that the Lord had said unto me—Therefore say unto them, I pray thee, thou art my sister, that it may be well with me for thy sake, and my soul shall live because of thee.",
                            "verse": 25
                        }
                    ]
                },
                {
                    "chapter": 3,
                    "reference": "Abraham 3",
                    "verses": [
                        {
                            "reference": "Abraham 3:1",
                            "text": "And I, Abraham, had the Urim and Thummim, which the Lord my God had given unto me, in Ur of the Chaldees;",
                            "verse": 1
                        },
                        {
                            "reference": "Abraham 3:2",
                            "text": "And I saw the stars, that they were very great, and that one of them was nearest unto the throne of God; and there were many great ones which were near unto it;",
                            "verse": 2
                        },
                        {
                            "reference": "Abraham 3:3",
                            "text": "And the Lord said unto me: These are the governing ones; and the name of the great one is Kolob, because it is near unto me, for I am the Lord thy God: I have set this one to govern all those which belong to the same order as that upon which thou standest.",
                            "verse": 3
                        },
                        {
                            "reference": "Abraham 3:4",
                            "text": "And the Lord said unto me, by the Urim and Thummim, that Kolob was after the manner of the Lord, according to its times and seasons in the revolutions thereof; that one revolution was a day unto the Lord, after his manner of reckoning, it being one thousand years according to the time appointed unto that whereon thou standest. This is the reckoning of the Lord's time, according to the reckoning of Kolob.",
                            "verse": 4
                        },
                        {
                            "reference": "Abraham 3:5",
                            "text": "And the Lord said unto me: The planet which is the lesser light, lesser than that which is to rule the day, even the night, is above or greater than that upon which thou standest in point of reckoning, for it moveth in order more slow; this is in order because it standeth above the earth upon which thou standest, therefore the reckoning of its time is not so many as to its number of days, and of months, and of years.",
                            "verse": 5
                        },
                        {
                            "reference": "Abraham 3:6",
                            "text": "And the Lord said unto me: Now, Abraham, these two facts exist, behold thine eyes see it; it is given unto thee to know the times of reckoning, and the set time, yea, the set time of the earth upon which thou standest, and the set time of the greater light which is set to rule the day, and the set time of the lesser light which is set to rule the night.",
                            "verse": 6
                        },
                        {
                            "reference": "Abraham 3:7",
                            "text": "Now the set time of the lesser light is a longer time as to its reckoning than the reckoning of the time of the earth upon which thou standest.",
                            "verse": 7
                        },
                        {
                            "reference": "Abraham 3:8",
                            "text": "And where these two facts exist, there shall be another fact above them, that is, there shall be another planet whose reckoning of time shall be longer still;",
                            "verse": 8
                        },
                        {
                            "reference": "Abraham 3:9",
                            "text": "And thus there shall be the reckoning of the time of one planet above another, until thou come nigh unto Kolob, which Kolob is after the reckoning of the Lord's time; which Kolob is set nigh unto the throne of God, to govern all those planets which belong to the same order as that upon which thou standest.",
                            "verse": 9
                        },
                        {
                            "reference": "Abraham 3:10",
                            "text": "And it is given unto thee to know the set time of all the stars that are set to give light, until thou come near unto the throne of God.",
                            "verse": 10
                        },
                        {
                            "reference": "Abraham 3:11",
                            "text": "Thus I, Abraham, talked with the Lord, face to face, as one man talketh with another; and he told me of the works which his hands had made;",
                            "verse": 11
                        },
                        {
                            "reference": "Abraham 3:12",
                            "text": "And he said unto me: My son, my son (and his hand was stretched out), behold I will show you all these. And he put his hand upon mine eyes, and I saw those things which his hands had made, which were many; and they multiplied before mine eyes, and I could not see the end thereof.",
                            "verse": 12
                        },
                        {
                            "reference": "Abraham 3:13",
                            "text": "And he said unto me: This is Shinehah, which is the sun. And he said unto me: Kokob, which is star. And he said unto me: Olea, which is the moon. And he said unto me: Kokaubeam, which signifies stars, or all the great lights, which were in the firmament of heaven.",
                            "verse": 13
                        },
                        {
                            "reference": "Abraham 3:14",
                            "text": "And it was in the night time when the Lord spake these words unto me: I will multiply thee, and thy seed after thee, like unto these; and if thou canst count the number of sands, so shall be the number of thy seeds.",
                            "verse": 14
                        },
                        {
                            "reference": "Abraham 3:15",
                            "text": "And the Lord said unto me: Abraham, I show these things unto thee before ye go into Egypt, that ye may declare all these words.",
                            "verse": 15
                        },
                        {
                            "reference": "Abraham 3:16",
                            "text": "If two things exist, and there be one above the other, there shall be greater things above them; therefore Kolob is the greatest of all the Kokaubeam that thou hast seen, because it is nearest unto me.",
                            "verse": 16
                        },
                        {
                            "reference": "Abraham 3:17",
                            "text": "Now, if there be two things, one above the other, and the moon be above the earth, then it may be that a planet or a star may exist above it; and there is nothing that the Lord thy God shall take in his heart to do but what he will do it.",
                            "verse": 17
                        },
                        {
                            "reference": "Abraham 3:18",
                            "text": "Howbeit that he made the greater star; as, also, if there be two spirits, and one shall be more intelligent than the other, yet these two spirits, notwithstanding one is more intelligent than the other, have no beginning; they existed before, they shall have no end, they shall exist after, for they are gnolaum, or eternal.",
                            "verse": 18
                        },
                        {
                            "reference": "Abraham 3:19",
                            "text": "And the Lord said unto me: These two facts do exist, that there are two spirits, one being more intelligent than the other; there shall be another more intelligent than they; I am the Lord thy God, I am more intelligent than they all.",
                            "verse": 19
                        },
                        {
                            "reference": "Abraham 3:20",
                            "text": "The Lord thy God sent his angel to deliver thee from the hands of the priest of Elkenah.",
                            "verse": 20
                        },
                        {
                            "reference": "Abraham 3:21",
                            "text": "I dwell in the midst of them all; I now, therefore, have come down unto thee to declare unto thee the works which my hands have made, wherein my wisdom excelleth them all, for I rule in the heavens above, and in the earth beneath, in all wisdom and prudence, over all the intelligences thine eyes have seen from the beginning; I came down in the beginning in the midst of all the intelligences thou hast seen.",
                            "verse": 21
                        },
                        {
                            "reference": "Abraham 3:22",
                            "text": "Now the Lord had shown unto me, Abraham, the intelligences that were organized before the world was; and among all these there were many of the noble and great ones;",
                            "verse": 22
                        },
                        {
                            "reference": "Abraham 3:23",
                            "text": "And God saw these souls that they were good, and he stood in the midst of them, and he said: These I will make my rulers; for he stood among those that were spirits, and he saw that they were good; and he said unto me: Abraham, thou art one of them; thou wast chosen before thou wast born.",
                            "verse": 23
                        },
                        {
                            "reference": "Abraham 3:24",
                            "text": "And there stood one among them that was like unto God, and he said unto those who were with him: We will go down, for there is space there, and we will take of these materials, and we will make an earth whereon these may dwell;",
                            "verse": 24
                        },
                        {
                            "reference": "Abraham 3:25",
                            "text": "And we will prove them herewith, to see if they will do all things whatsoever the Lord their God shall command them;",
                            "verse": 25
                        },
                        {
                            "reference": "Abraham 3:26",
                            "text": "And they who keep their first estate shall be added upon; and they who keep not their first estate shall not have glory in the same kingdom with those who keep their first estate; and they who keep their second estate shall have glory added upon their heads for ever and ever.",
                            "verse": 26
                        },
                        {
                            "reference": "Abraham 3:27",
                            "text": "And the Lord said: Whom shall I send? And one answered like unto the Son of Man: Here am I, send me. And another answered and said: Here am I, send me. And the Lord said: I will send the first.",
                            "verse": 27
                        },
                        {
                            "reference": "Abraham 3:28",
                            "text": "And the second was angry, and kept not his first estate; and, at that day, many followed after him.",
                            "verse": 28
                        }
                    ]
                },
                {
                    "chapter": 4,
                    "reference": "Abraham 4",
                    "verses": [
                        {
                            "reference": "Abraham 4:1",
                            "text": "And then the Lord said: Let us go down. And they went down at the beginning, and they, that is the Gods, organized and formed the heavens and the earth.",
                            "verse": 1
                        },
                        {
                            "reference": "Abraham 4:2",
                            "text": "And the earth, after it was formed, was empty and desolate, because they had not formed anything but the earth; and darkness reigned upon the face of the deep, and the Spirit of the Gods was brooding upon the face of the waters.",
                            "verse": 2
                        },
                        {
                            "reference": "Abraham 4:3",
                            "text": "And they (the Gods) said: Let there be light; and there was light.",
                            "verse": 3
                        },
                        {
                            "reference": "Abraham 4:4",
                            "text": "And they (the Gods) comprehended the light, for it was bright; and they divided the light, or caused it to be divided, from the darkness.",
                            "verse": 4
                        },
                        {
                            "reference": "Abraham 4:5",
                            "text": "And the Gods called the light Day, and the darkness they called Night. And it came to pass that from the evening until morning they called night; and from the morning until the evening they called day; and this was the first, or the beginning, of that which they called day and night.",
                            "verse": 5
                        },
                        {
                            "reference": "Abraham 4:6",
                            "text": "And the Gods also said: Let there be an expanse in the midst of the waters, and it shall divide the waters from the waters.",
                            "verse": 6
                        },
                        {
                            "reference": "Abraham 4:7",
                            "text": "And the Gods ordered the expanse, so that it divided the waters which were under the expanse from the waters which were above the expanse; and it was so, even as they ordered.",
                            "verse": 7
                        },
                        {
                            "reference": "Abraham 4:8",
                            "text": "And the Gods called the expanse, Heaven. And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and this was the second time that they called night and day.",
                            "verse": 8
                        },
                        {
                            "reference": "Abraham 4:9",
                            "text": "And the Gods ordered, saying: Let the waters under the heaven be gathered together unto one place, and let the earth come up dry; and it was so as they ordered;",
                            "verse": 9
                        },
                        {
                            "reference": "Abraham 4:10",
                            "text": "And the Gods pronounced the dry land, Earth; and the gathering together of the waters, pronounced they, Great Waters; and the Gods saw that they were obeyed.",
                            "verse": 10
                        },
                        {
                            "reference": "Abraham 4:11",
                            "text": "And the Gods said: Let us prepare the earth to bring forth grass; the herb yielding seed; the fruit tree yielding fruit, after his kind, whose seed in itself yieldeth its own likeness upon the earth; and it was so, even as they ordered.",
                            "verse": 11
                        },
                        {
                            "reference": "Abraham 4:12",
                            "text": "And the Gods organized the earth to bring forth grass from its own seed, and the herb to bring forth herb from its own seed, yielding seed after his kind; and the earth to bring forth the tree from its own seed, yielding fruit, whose seed could only bring forth the same in itself, after his kind; and the Gods saw that they were obeyed.",
                            "verse": 12
                        },
                        {
                            "reference": "Abraham 4:13",
                            "text": "And it came to pass that they numbered the days; from the evening until the morning they called night; and it came to pass, from the morning until the evening they called day; and it was the third time.",
                            "verse": 13
                        },
                        {
                            "reference": "Abraham 4:14",
                            "text": "And the Gods organized the lights in the expanse of the heaven, and caused them to divide the day from the night; and organized them to be for signs and for seasons, and for days and for years;",
                            "verse": 14
                        },
                        {
                            "reference": "Abraham 4:15",
                            "text": "And organized them to be for lights in the expanse of the heaven to give light upon the earth; and it was so.",
                            "verse": 15
                        },
                        {
                            "reference": "Abraham 4:16",
                            "text": "And the Gods organized the two great lights, the greater light to rule the day, and the lesser light to rule the night; with the lesser light they set the stars also;",
                            "verse": 16
                        },
                        {
                            "reference": "Abraham 4:17",
                            "text": "And the Gods set them in the expanse of the heavens, to give light upon the earth, and to rule over the day and over the night, and to cause to divide the light from the darkness.",
                            "verse": 17
                        },
                        {
                            "reference": "Abraham 4:18",
                            "text": "And the Gods watched those things which they had ordered until they obeyed.",
                            "verse": 18
                        },
                        {
                            "reference": "Abraham 4:19",
                            "text": "And it came to pass that it was from evening until morning that it was night; and it came to pass that it was from morning until evening that it was day; and it was the fourth time.",
                            "verse": 19
                        },
                        {
                            "reference": "Abraham 4:20",
                            "text": "And the Gods said: Let us prepare the waters to bring forth abundantly the moving creatures that have life; and the fowl, that they may fly above the earth in the open expanse of heaven.",
                            "verse": 20
                        },
                        {
                            "reference": "Abraham 4:21",
                            "text": "And the Gods prepared the waters that they might bring forth great whales, and every living creature that moveth, which the waters were to bring forth abundantly after their kind; and every winged fowl after their kind. And the Gods saw that they would be obeyed, and that their plan was good.",
                            "verse": 21
                        },
                        {
                            "reference": "Abraham 4:22",
                            "text": "And the Gods said: We will bless them, and cause them to be fruitful and multiply, and fill the waters in the seas or great waters; and cause the fowl to multiply in the earth.",
                            "verse": 22
                        },
                        {
                            "reference": "Abraham 4:23",
                            "text": "And it came to pass that it was from evening until morning that they called night; and it came to pass that it was from morning until evening that they called day; and it was the fifth time.",
                            "verse": 23
                        },
                        {
                            "reference": "Abraham 4:24",
                            "text": "And the Gods prepared the earth to bring forth the living creature after his kind, cattle and creeping things, and beasts of the earth after their kind; and it was so, as they had said.",
                            "verse": 24
                        },
                        {
                            "reference": "Abraham 4:25",
                            "text": "And the Gods organized the earth to bring forth the beasts after their kind, and cattle after their kind, and every thing that creepeth upon the earth after its kind; and the Gods saw they would obey.",
                            "verse": 25
                        },
                        {
                            "reference": "Abraham 4:26",
                            "text": "And the Gods took counsel among themselves and said: Let us go down and form man in our image, after our likeness; and we will give them dominion over the fish of the sea, and over the fowl of the air, and over the cattle, and over all the earth, and over every creeping thing that creepeth upon the earth.",
                            "verse": 26
                        },
                        {
                            "reference": "Abraham 4:27",
                            "text": "So the Gods went down to organize man in their own image, in the image of the Gods to form they him, male and female to form they them.",
                            "verse": 27
                        },
                        {
                            "reference": "Abraham 4:28",
                            "text": "And the Gods said: We will bless them. And the Gods said: We will cause them to be fruitful and multiply, and replenish the earth, and subdue it, and to have dominion over the fish of the sea, and over the fowl of the air, and over every living thing that moveth upon the earth.",
                            "verse": 28
                        },
                        {
                            "reference": "Abraham 4:29",
                            "text": "And the Gods said: Behold, we will give them every herb bearing seed that shall come upon the face of all the earth, and every tree which shall have fruit upon it; yea, the fruit of the tree yielding seed to them we will give it; it shall be for their meat.",
                            "verse": 29
                        },
                        {
                            "reference": "Abraham 4:30",
                            "text": "And to every beast of the earth, and to every fowl of the air, and to every thing that creepeth upon the earth, behold, we will give them life, and also we will give to them every green herb for meat, and all these things shall be thus organized.",
                            "verse": 30
                        },
                        {
                            "reference": "Abraham 4:31",
                            "text": "And the Gods said: We will do everything that we have said, and organize them; and behold, they shall be very obedient. And it came to pass that it was from evening until morning they called night; and it came to pass that it was from morning until evening that they called day; and they numbered the sixth time.",
                            "verse": 31
                        }
                    ]
                },
                {
                    "chapter": 5,
                    "reference": "Abraham 5",
                    "verses": [
                        {
                            "reference": "Abraham 5:1",
                            "text": "And thus we will finish the heavens and the earth, and all the hosts of them.",
                            "verse": 1
                        },
                        {
                            "reference": "Abraham 5:2",
                            "text": "And the Gods said among themselves: On the seventh time we will end our work, which we have counseled; and we will rest on the seventh time from all our work which we have counseled.",
                            "verse": 2
                        },
                        {
                            "reference": "Abraham 5:3",
                            "text": "And the Gods concluded upon the seventh time, because that on the seventh time they would rest from all their works which they (the Gods) counseled among themselves to form; and sanctified it. And thus were their decisions at the time that they counseled among themselves to form the heavens and the earth.",
                            "verse": 3
                        },
                        {
                            "reference": "Abraham 5:4",
                            "text": "And the Gods came down and formed these the generations of the heavens and of the earth, when they were formed in the day that the Gods formed the earth and the heavens,",
                            "verse": 4
                        },
                        {
                            "reference": "Abraham 5:5",
                            "text": "According to all that which they had said concerning every plant of the field before it was in the earth, and every herb of the field before it grew; for the Gods had not caused it to rain upon the earth when they counseled to do them, and had not formed a man to till the ground.",
                            "verse": 5
                        },
                        {
                            "reference": "Abraham 5:6",
                            "text": "But there went up a mist from the earth, and watered the whole face of the ground.",
                            "verse": 6
                        },
                        {
                            "reference": "Abraham 5:7",
                            "text": "And the Gods formed man from the dust of the ground, and took his spirit (that is, the man's spirit), and put it into him; and breathed into his nostrils the breath of life, and man became a living soul.",
                            "verse": 7
                        },
                        {
                            "reference": "Abraham 5:8",
                            "text": "And the Gods planted a garden, eastward in Eden, and there they put the man, whose spirit they had put into the body which they had formed.",
                            "verse": 8
                        },
                        {
                            "reference": "Abraham 5:9",
                            "text": "And out of the ground made the Gods to grow every tree that is pleasant to the sight and good for food; the tree of life, also, in the midst of the garden, and the tree of knowledge of good and evil.",
                            "verse": 9
                        },
                        {
                            "reference": "Abraham 5:10",
                            "text": "There was a river running out of Eden, to water the garden, and from thence it was parted and became into four heads.",
                            "verse": 10
                        },
                        {
                            "reference": "Abraham 5:11",
                            "text": "And the Gods took the man and put him in the Garden of Eden, to dress it and to keep it.",
                            "verse": 11
                        },
                        {
                            "reference": "Abraham 5:12",
                            "text": "And the Gods commanded the man, saying: Of every tree of the garden thou mayest freely eat,",
                            "verse": 12
                        },
                        {
                            "reference": "Abraham 5:13",
                            "text": "But of the tree of knowledge of good and evil, thou shalt not eat of it; for in the time that thou eatest thereof, thou shalt surely die. Now I, Abraham, saw that it was after the Lord's time, which was after the time of Kolob; for as yet the Gods had not appointed unto Adam his reckoning.",
                            "verse": 13
                        },
                        {
                            "reference": "Abraham 5:14",
                            "text": "And the Gods said: Let us make an help meet for the man, for it is not good that the man should be alone, therefore we will form an help meet for him.",
                            "verse": 14
                        },
                        {
                            "reference": "Abraham 5:15",
                            "text": "And the Gods caused a deep sleep to fall upon Adam; and he slept, and they took one of his ribs, and closed up the flesh in the stead thereof;",
                            "verse": 15
                        },
                        {
                            "reference": "Abraham 5:16",
                            "text": "And of the rib which the Gods had taken from man, formed they a woman, and brought her unto the man.",
                            "verse": 16
                        },
                        {
                            "reference": "Abraham 5:17",
                            "text": "And Adam said: This was bone of my bones, and flesh of my flesh; now she shall be called Woman, because she was taken out of man;",
                            "verse": 17
                        },
                        {
                            "reference": "Abraham 5:18",
                            "text": "Therefore shall a man leave his father and his mother, and shall cleave unto his wife, and they shall be one flesh.",
                            "verse": 18
                        },
                        {
                            "reference": "Abraham 5:19",
                            "text": "And they were both naked, the man and his wife, and were not ashamed.",
                            "verse": 19
                        },
                        {
                            "reference": "Abraham 5:20",
                            "text": "And out of the ground the Gods formed every beast of the field, and every fowl of the air, and brought them unto Adam to see what he would call them; and whatsoever Adam called every living creature, that should be the name thereof.",
                            "verse": 20
                        },
                        {
                            "reference": "Abraham 5:21",
                            "text": "And Adam gave names to all cattle, to the fowl of the air, to every beast of the field; and for Adam, there was found an help meet for him.",
                            "verse": 21
                        }
                    ]
                }
            ],
			"facsimiles": [
				{
					"explanations": [
						"1. The Angel of the Lord.",
						"2. Abraham fastened upon an altar.",
						"3. The idolatrous priest of Elkenah attempting to offer up Abraham as a sacrifice.",
						"4. The altar for sacrifice by the idolatrous priests, standing before the gods of Elkenah, Libnah, Mahmackrah, Korash, and Pharaoh.",
						"5. The idolatrous god of Elkenah.",
						"6. The idolatrous god of Libnah.",
						"7. The idolatrous god of Mahmackrah.",
						"8. The idolatrous god of Korash.",
						"9. The idolatrous god of Pharaoh.",
						"10. Abraham in Egypt.",
						"11. Designed to represent the pillars of heaven, as understood by the Egyptians.",
						"12. Raukeeyang, signifying expanse, or the firmament over our heads; but in this case, in relation to this subject, the Egyptians meant it to signify Shaumau, to be high, or the heavens, answering to the Hebrew word, Shaumahyeem."
					],
					"image_url": "https://www.lds.org/scriptures/bc/scriptures/content/english/bible-maps/images/03990_000_fac-1.jpg",
					"lds_slug": "fac-1",
					"number": 1,
					"title": "A Facsimile from the Book of Abraham No. 1"
				},
				{
					"explanations": [
						"1. Kolob, signifying the first creation, nearest to the celestial, or the residence of God. First in government, the last pertaining to the measurement of time. The measurement according to celestial time, which celestial time signifies one day to a cubit. One day in Kolob is equal to a thousand years according to the measurement of this earth, which is called by the Egyptians Jah-oh-eh.",
						"2. Stands next to Kolob, called by the Egyptians Oliblish, which is the next grand governing creation near to the celestial or the place where God resides; holding the key of power also, pertaining to other planets; as revealed from God to Abraham, as he offered sacrifice upon an altar, which he had built unto the Lord.",
						"3. Is made to represent God, sitting upon his throne, clothed with power and authority; with a crown of eternal light upon his head; representing also the grand Key-words of the Holy Priesthood, as revealed to Adam in the Garden of Eden, as also to Seth, Noah, Melchizedek, Abraham, and all to whom the Priesthood was revealed.",
						"4. Answers to the Hebrew word Raukeeyang, signifying expanse, or the firmament of the heavens; also a numerical figure, in Egyptian signifying one thousand; answering to the measuring of the time of Oliblish, which is equal with Kolob in its revolution and in its measuring of time.",
						"5. Is called in Egyptian Enish-go-on-dosh; this is one of the governing planets also, and is said by the Egyptians to be the Sun, and to borrow its light from Kolob through the medium of Kae-e-vanrash, which is the grand Key, or, in other words, the governing power, which governs fifteen other fixed planets or stars, as also Floeese or the Moon, the Earth and the Sun in their annual revolutions. This planet receives its power through the medium of Kli-flos-is-es, or Hah-ko-kau-beam, the stars represented by numbers 22 and 23, receiving light from the revolutions of Kolob.",
						"6. Represents this earth in its four quarters.",
						"7. Represents God sitting upon his throne, revealing through the heavens the grand Key-words of the Priesthood; as, also, the sign of the Holy Ghost unto Abraham, in the form of a dove.",
						"8. Contains writings that cannot be revealed unto the world; but is to be had in the Holy Temple of God.",
						"9. Ought not to be revealed at the present time.",
						"10. Also.",
						"11. Also. If the world can find out these numbers, so let it be. Amen.",
						"12. Figures 12, 13, 14, 15, 16, 17, 18, 19, 20, and 21 will be given in the own due time of the Lord."
					],
					"image_url": "https://www.lds.org/scriptures/bc/scriptures/content/english/bible-maps/images/03990_000_fac-2.jpg",
					"lds_slug": "fac-2",
					"note": "The above translation is given as far as we have any right to give at the present time.",
					"number": 2,
					"title": "A Facsimile from the Book of Abraham No. 2"
				},
				{
					"explanations": [
						"1. Abraham sitting upon Pharaoh's throne, by the politeness of the king, with a crown upon his head, representing the Priesthood, as emblematical of the grand Presidency in Heaven; with the scepter of justice and judgment in his hand.",
						"2. King Pharaoh, whose name is given in the characters above his head.",
						"3. Signifies Abraham in Egypt as given also in Figure 10 of Facsimile No. 1.",
						"4. Prince of Pharaoh, King of Egypt, as written above the hand.",
						"5. Shulem, one of the king's principal waiters, as represented by the characters above his hand.",
						"6. Olimlah, a slave belonging to the prince."
					],
					"image_url": "https://www.lds.org/scriptures/bc/scriptures/content/english/bible-maps/images/03990_000_fac-3.jpg",
					"lds_slug": "fac-3",
					"note": "Abraham is reasoning upon the principles of Astronomy, in the king's court.",
					"number": 3,
					"title": "A Facsimile from the Book of Abraham No. 3"
				}
			],
			"full_subtitle": "Translated from the Papyrus, by Joseph Smith",
			"full_title": "The Book of Abraham",
            "lds_slug": "abr"
        },
        {
            "book": "Joseph Smith—Matthew",
            "chapters": [
                {
                    "chapter": 1,
                    "reference": "Joseph Smith—Matthew 1",
                    "verses": [
                        {
                            "reference": "Joseph Smith—Matthew 1:1",
                            "text": "For I say unto you, that ye shall not see me henceforth and know that I am he of whom it is written by the prophets, until ye shall say: Blessed is he who cometh in the name of the Lord, in the clouds of heaven, and all the holy angels with him. Then understood his disciples that he should come again on the earth, after that he was glorified and crowned on the right hand of God.",
                            "verse": 1
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:2",
                            "text": "And Jesus went out, and departed from the temple; and his disciples came to him, for to hear him, saying: Master, show us concerning the buildings of the temple, as thou hast said—They shall be thrown down, and left unto you desolate.",
                            "verse": 2
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:3",
                            "text": "And Jesus said unto them: See ye not all these things, and do ye not understand them? Verily I say unto you, there shall not be left here, upon this temple, one stone upon another that shall not be thrown down.",
                            "verse": 3
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:4",
                            "text": "And Jesus left them, and went upon the Mount of Olives. And as he sat upon the Mount of Olives, the disciples came unto him privately, saying: Tell us when shall these things be which thou hast said concerning the destruction of the temple, and the Jews; and what is the sign of thy coming, and of the end of the world, or the destruction of the wicked, which is the end of the world?",
                            "verse": 4
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:5",
                            "text": "And Jesus answered, and said unto them: Take heed that no man deceive you;",
                            "verse": 5
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:6",
                            "text": "For many shall come in my name, saying—I am Christ—and shall deceive many;",
                            "verse": 6
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:7",
                            "text": "Then shall they deliver you up to be afflicted, and shall kill you, and ye shall be hated of all nations, for my name's sake;",
                            "verse": 7
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:8",
                            "text": "And then shall many be offended, and shall betray one another, and shall hate one another;",
                            "verse": 8
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:9",
                            "text": "And many false prophets shall arise, and shall deceive many;",
                            "verse": 9
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:10",
                            "text": "And because iniquity shall abound, the love of many shall wax cold;",
                            "verse": 10
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:11",
                            "text": "But he that remaineth steadfast and is not overcome, the same shall be saved.",
                            "verse": 11
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:12",
                            "text": "When you, therefore, shall see the abomination of desolation, spoken of by Daniel the prophet, concerning the destruction of Jerusalem, then you shall stand in the holy place; whoso readeth let him understand.",
                            "verse": 12
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:13",
                            "text": "Then let them who are in Judea flee into the mountains;",
                            "verse": 13
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:14",
                            "text": "Let him who is on the housetop flee, and not return to take anything out of his house;",
                            "verse": 14
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:15",
                            "text": "Neither let him who is in the field return back to take his clothes;",
                            "verse": 15
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:16",
                            "text": "And wo unto them that are with child, and unto them that give suck in those days;",
                            "verse": 16
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:17",
                            "text": "Therefore, pray ye the Lord that your flight be not in the winter, neither on the Sabbath day;",
                            "verse": 17
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:18",
                            "text": "For then, in those days, shall be great tribulation on the Jews, and upon the inhabitants of Jerusalem, such as was not before sent upon Israel, of God, since the beginning of their kingdom until this time; no, nor ever shall be sent again upon Israel.",
                            "verse": 18
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:19",
                            "text": "All things which have befallen them are only the beginning of the sorrows which shall come upon them.",
                            "verse": 19
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:20",
                            "text": "And except those days should be shortened, there should none of their flesh be saved; but for the elect's sake, according to the covenant, those days shall be shortened.",
                            "verse": 20
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:21",
                            "text": "Behold, these things I have spoken unto you concerning the Jews; and again, after the tribulation of those days which shall come upon Jerusalem, if any man shall say unto you, Lo, here is Christ, or there, believe him not;",
                            "verse": 21
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:22",
                            "text": "For in those days there shall also arise false Christs, and false prophets, and shall show great signs and wonders, insomuch, that, if possible, they shall deceive the very elect, who are the elect according to the covenant.",
                            "verse": 22
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:23",
                            "text": "Behold, I speak these things unto you for the elect's sake; and you also shall hear of wars, and rumors of wars; see that ye be not troubled, for all I have told you must come to pass; but the end is not yet.",
                            "verse": 23
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:24",
                            "text": "Behold, I have told you before;",
                            "verse": 24
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:25",
                            "text": "Wherefore, if they shall say unto you: Behold, he is in the desert; go not forth: Behold, he is in the secret chambers; believe it not;",
                            "verse": 25
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:26",
                            "text": "For as the light of the morning cometh out of the east, and shineth even unto the west, and covereth the whole earth, so shall also the coming of the Son of Man be.",
                            "verse": 26
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:27",
                            "text": "And now I show unto you a parable. Behold, wheresoever the carcass is, there will the eagles be gathered together; so likewise shall mine elect be gathered from the four quarters of the earth.",
                            "verse": 27
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:28",
                            "text": "And they shall hear of wars, and rumors of wars.",
                            "verse": 28
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:29",
                            "text": "Behold I speak for mine elect's sake; for nation shall rise against nation, and kingdom against kingdom; there shall be famines, and pestilences, and earthquakes, in divers places.",
                            "verse": 29
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:30",
                            "text": "And again, because iniquity shall abound, the love of men shall wax cold; but he that shall not be overcome, the same shall be saved.",
                            "verse": 30
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:31",
                            "text": "And again, this Gospel of the Kingdom shall be preached in all the world, for a witness unto all nations, and then shall the end come, or the destruction of the wicked;",
                            "verse": 31
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:32",
                            "text": "And again shall the abomination of desolation, spoken of by Daniel the prophet, be fulfilled.",
                            "verse": 32
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:33",
                            "text": "And immediately after the tribulation of those days, the sun shall be darkened, and the moon shall not give her light, and the stars shall fall from heaven, and the powers of heaven shall be shaken.",
                            "verse": 33
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:34",
                            "text": "Verily, I say unto you, this generation, in which these things shall be shown forth, shall not pass away until all I have told you shall be fulfilled.",
                            "verse": 34
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:35",
                            "text": "Although, the days will come, that heaven and earth shall pass away; yet my words shall not pass away, but all shall be fulfilled.",
                            "verse": 35
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:36",
                            "text": "And, as I said before, after the tribulation of those days, and the powers of the heavens shall be shaken, then shall appear the sign of the Son of Man in heaven, and then shall all the tribes of the earth mourn; and they shall see the Son of Man coming in the clouds of heaven, with power and great glory;",
                            "verse": 36
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:37",
                            "text": "And whoso treasureth up my word, shall not be deceived, for the Son of Man shall come, and he shall send his angels before him with the great sound of a trumpet, and they shall gather together the remainder of his elect from the four winds, from one end of heaven to the other.",
                            "verse": 37
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:38",
                            "text": "Now learn a parable of the fig tree—When its branches are yet tender, and it begins to put forth leaves, you know that summer is nigh at hand;",
                            "verse": 38
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:39",
                            "text": "So likewise, mine elect, when they shall see all these things, they shall know that he is near, even at the doors;",
                            "verse": 39
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:40",
                            "text": "But of that day, and hour, no one knoweth; no, not the angels of God in heaven, but my Father only.",
                            "verse": 40
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:41",
                            "text": "But as it was in the days of Noah, so it shall be also at the coming of the Son of Man;",
                            "verse": 41
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:42",
                            "text": "For it shall be with them, as it was in the days which were before the flood; for until the day that Noah entered into the ark they were eating and drinking, marrying and giving in marriage;",
                            "verse": 42
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:43",
                            "text": "And knew not until the flood came, and took them all away; so shall also the coming of the Son of Man be.",
                            "verse": 43
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:44",
                            "text": "Then shall be fulfilled that which is written, that in the last days, two shall be in the field, the one shall be taken, and the other left;",
                            "verse": 44
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:45",
                            "text": "Two shall be grinding at the mill, the one shall be taken, and the other left;",
                            "verse": 45
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:46",
                            "text": "And what I say unto one, I say unto all men; watch, therefore, for you know not at what hour your Lord doth come.",
                            "verse": 46
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:47",
                            "text": "But know this, if the good man of the house had known in what watch the thief would come, he would have watched, and would not have suffered his house to have been broken up, but would have been ready.",
                            "verse": 47
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:48",
                            "text": "Therefore be ye also ready, for in such an hour as ye think not, the Son of Man cometh.",
                            "verse": 48
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:49",
                            "text": "Who, then, is a faithful and wise servant, whom his lord hath made ruler over his household, to give them meat in due season?",
                            "verse": 49
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:50",
                            "text": "Blessed is that servant whom his lord, when he cometh, shall find so doing; and verily I say unto you, he shall make him ruler over all his goods.",
                            "verse": 50
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:51",
                            "text": "But if that evil servant shall say in his heart: My lord delayeth his coming,",
                            "verse": 51
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:52",
                            "text": "And shall begin to smite his fellow-servants, and to eat and drink with the drunken,",
                            "verse": 52
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:53",
                            "text": "The lord of that servant shall come in a day when he looketh not for him, and in an hour that he is not aware of,",
                            "verse": 53
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:54",
                            "text": "And shall cut him asunder, and shall appoint him his portion with the hypocrites; there shall be weeping and gnashing of teeth.",
                            "verse": 54
                        },
                        {
                            "reference": "Joseph Smith—Matthew 1:55",
                            "text": "And thus cometh the end of the wicked, according to the prophecy of Moses, saying: They shall be cut off from among the people; but the end of the earth is not yet, but by and by.",
                            "verse": 55
                        }
                    ]
                }
            ],
			"full_title": "Joseph Smith—Matthew",
            "lds_slug": "js-m"
        },
        {
            "book": "Joseph Smith—History",
            "chapters": [
                {
                    "chapter": 1,
                    "reference": "Joseph Smith—History 1",
                    "verses": [
                        {
                            "reference": "Joseph Smith—History 1:1",
                            "text": "Owing to the many reports which have been put in circulation by evil-disposed and designing persons, in relation to the rise and progress of The Church of Jesus Christ of Latter-day Saints, all of which have been designed by the authors thereof to militate against its character as a Church and its progress in the world—I have been induced to write this history, to disabuse the public mind, and put all inquirers after truth in possession of the facts, as they have transpired, in relation both to myself and the Church, so far as I have such facts in my possession.",
                            "verse": 1
                        },
                        {
                            "reference": "Joseph Smith—History 1:2",
                            "text": "In this history I shall present the various events in relation to this Church, in truth and righteousness, as they have transpired, or as they at present exist, being now [1838] the eighth year since the organization of the said Church.",
                            "verse": 2
                        },
                        {
                            "reference": "Joseph Smith—History 1:3",
                            "text": "I was born in the year of our Lord one thousand eight hundred and five, on the twenty-third day of December, in the town of Sharon, Windsor county, State of Vermont. …  My father, Joseph Smith, Sen., left the State of Vermont, and moved to Palmyra, Ontario (now Wayne) county, in the State of New York, when I was in my tenth year, or thereabouts. In about four years after my father's arrival in Palmyra, he moved with his family into Manchester in the same county of Ontario—",
                            "verse": 3
                        },
                        {
                            "reference": "Joseph Smith—History 1:4",
                            "text": "His family consisting of eleven souls, namely, my father, Joseph Smith; my mother, Lucy Smith (whose name, previous to her marriage, was Mack, daughter of Solomon Mack); my brothers, Alvin (who died November 19th, 1823, in the 26th year of his age), Hyrum, myself, Samuel Harrison, William, Don Carlos; and my sisters, Sophronia, Catherine, and Lucy.",
                            "verse": 4
                        },
                        {
                            "reference": "Joseph Smith—History 1:5",
                            "text": "Some time in the second year after our removal to Manchester, there was in the place where we lived an unusual excitement on the subject of religion. It commenced with the Methodists, but soon became general among all the sects in that region of country. Indeed, the whole district of country seemed affected by it, and great multitudes united themselves to the different religious parties, which created no small stir and division amongst the people, some crying, \"Lo, here!\" and others, \"Lo, there!\" Some were contending for the Methodist faith, some for the Presbyterian, and some for the Baptist.",
                            "verse": 5
                        },
                        {
                            "reference": "Joseph Smith—History 1:6",
                            "text": "For, notwithstanding the great love which the converts to these different faiths expressed at the time of their conversion, and the great zeal manifested by the respective clergy, who were active in getting up and promoting this extraordinary scene of religious feeling, in order to have everybody converted, as they were pleased to call it, let them join what sect they pleased; yet when the converts began to file off, some to one party and some to another, it was seen that the seemingly good feelings of both the priests and the converts were more pretended than real; for a scene of great confusion and bad feeling ensued—priest contending against priest, and convert against convert; so that all their good feelings one for another, if they ever had any, were entirely lost in a strife of words and a contest about opinions.",
                            "verse": 6
                        },
                        {
                            "reference": "Joseph Smith—History 1:7",
                            "text": "I was at this time in my fifteenth year. My father's family was proselyted to the Presbyterian faith, and four of them joined that church, namely, my mother, Lucy; my brothers Hyrum and Samuel Harrison; and my sister Sophronia.",
                            "verse": 7
                        },
                        {
                            "reference": "Joseph Smith—History 1:8",
                            "text": "During this time of great excitement my mind was called up to serious reflection and great uneasiness; but though my feelings were deep and often poignant, still I kept myself aloof from all these parties, though I attended their several meetings as often as occasion would permit. In process of time my mind became somewhat partial to the Methodist sect, and I felt some desire to be united with them; but so great were the confusion and strife among the different denominations, that it was impossible for a person young as I was, and so unacquainted with men and things, to come to any certain conclusion who was right and who was wrong.",
                            "verse": 8
                        },
                        {
                            "reference": "Joseph Smith—History 1:9",
                            "text": "My mind at times was greatly excited, the cry and tumult were so great and incessant. The Presbyterians were most decided against the Baptists and Methodists, and used all the powers of both reason and sophistry to prove their errors, or, at least, to make the people think they were in error. On the other hand, the Baptists and Methodists in their turn were equally zealous in endeavoring to establish their own tenets and disprove all others.",
                            "verse": 9
                        },
                        {
                            "reference": "Joseph Smith—History 1:10",
                            "text": "In the midst of this war of words and tumult of opinions, I often said to myself: What is to be done? Who of all these parties are right; or, are they all wrong together? If any one of them be right, which is it, and how shall I know it?",
                            "verse": 10
                        },
                        {
                            "reference": "Joseph Smith—History 1:11",
                            "text": "While I was laboring under the extreme difficulties caused by the contests of these parties of religionists, I was one day reading the Epistle of James, first chapter and fifth verse, which reads: If any of you lack wisdom, let him ask of God, that giveth to all men liberally, and upbraideth not; and it shall be given him.",
                            "verse": 11
                        },
                        {
                            "reference": "Joseph Smith—History 1:12",
                            "text": "Never did any passage of scripture come with more power to the heart of man than this did at this time to mine. It seemed to enter with great force into every feeling of my heart. I reflected on it again and again, knowing that if any person needed wisdom from God, I did; for how to act I did not know, and unless I could get more wisdom than I then had, I would never know; for the teachers of religion of the different sects understood the same passages of scripture so differently as to destroy all confidence in settling the question by an appeal to the Bible.",
                            "verse": 12
                        },
                        {
                            "reference": "Joseph Smith—History 1:13",
                            "text": "At length I came to the conclusion that I must either remain in darkness and confusion, or else I must do as James directs, that is, ask of God. I at length came to the determination to \"ask of God,\" concluding that if he gave wisdom to them that lacked wisdom, and would give liberally, and not upbraid, I might venture.",
                            "verse": 13
                        },
                        {
                            "reference": "Joseph Smith—History 1:14",
                            "text": "So, in accordance with this, my determination to ask of God, I retired to the woods to make the attempt. It was on the morning of a beautiful, clear day, early in the spring of eighteen hundred and twenty. It was the first time in my life that I had made such an attempt, for amidst all my anxieties I had never as yet made the attempt to pray vocally.",
                            "verse": 14
                        },
                        {
                            "reference": "Joseph Smith—History 1:15",
                            "text": "After I had retired to the place where I had previously designed to go, having looked around me, and finding myself alone, I kneeled down and began to offer up the desires of my heart to God. I had scarcely done so, when immediately I was seized upon by some power which entirely overcame me, and had such an astonishing influence over me as to bind my tongue so that I could not speak. Thick darkness gathered around me, and it seemed to me for a time as if I were doomed to sudden destruction.",
                            "verse": 15
                        },
                        {
                            "reference": "Joseph Smith—History 1:16",
                            "text": "But, exerting all my powers to call upon God to deliver me out of the power of this enemy which had seized upon me, and at the very moment when I was ready to sink into despair and abandon myself to destruction—not to an imaginary ruin, but to the power of some actual being from the unseen world, who had such marvelous power as I had never before felt in any being—just at this moment of great alarm, I saw a pillar of light exactly over my head, above the brightness of the sun, which descended gradually until it fell upon me.",
                            "verse": 16
                        },
                        {
                            "reference": "Joseph Smith—History 1:17",
                            "text": "It no sooner appeared than I found myself delivered from the enemy which held me bound. When the light rested upon me I saw two Personages, whose brightness and glory defy all description, standing above me in the air. One of them spake unto me, calling me by name and said, pointing to the other—This is My Beloved Son. Hear Him!",
                            "verse": 17
                        },
                        {
                            "reference": "Joseph Smith—History 1:18",
                            "text": "My object in going to inquire of the Lord was to know which of all the sects was right, that I might know which to join. No sooner, therefore, did I get possession of myself, so as to be able to speak, than I asked the Personages who stood above me in the light, which of all the sects was right (for at this time it had never entered into my heart that all were wrong)—and which I should join.",
                            "verse": 18
                        },
                        {
                            "reference": "Joseph Smith—History 1:19",
                            "text": "I was answered that I must join none of them, for they were all wrong; and the Personage who addressed me said that all their creeds were an abomination in his sight; that those professors were all corrupt; that: \"they draw near to me with their lips, but their hearts are far from me, they teach for doctrines the commandments of men, having a form of godliness, but they deny the power thereof.\"",
                            "verse": 19
                        },
                        {
                            "reference": "Joseph Smith—History 1:20",
                            "text": "He again forbade me to join with any of them; and many other things did he say unto me, which I cannot write at this time. When I came to myself again, I found myself lying on my back, looking up into heaven. When the light had departed, I had no strength; but soon recovering in some degree, I went home. And as I leaned up to the fireplace, mother inquired what the matter was. I replied, \"Never mind, all is well—I am well enough off.\" I then said to my mother, \"I have learned for myself that Presbyterianism is not true.\" It seems as though the adversary was aware, at a very early period of my life, that I was destined to prove a disturber and an annoyer of his kingdom; else why should the powers of darkness combine against me? Why the opposition and persecution that arose against me, almost in my infancy?",
                            "verse": 20
                        },
                        {
                            "reference": "Joseph Smith—History 1:21",
                            "text": "Some few days after I had this vision, I happened to be in company with one of the Methodist preachers, who was very active in the before mentioned religious excitement; and, conversing with him on the subject of religion, I took occasion to give him an account of the vision which I had had. I was greatly surprised at his behavior; he treated my communication not only lightly, but with great contempt, saying it was all of the devil, that there were no such things as visions or revelations in these days; that all such things had ceased with the apostles, and that there would never be any more of them.",
                            "verse": 21
                        },
                        {
                            "reference": "Joseph Smith—History 1:22",
                            "text": "I soon found, however, that my telling the story had excited a great deal of prejudice against me among professors of religion, and was the cause of great persecution, which continued to increase; and though I was an obscure boy, only between fourteen and fifteen years of age, and my circumstances in life such as to make a boy of no consequence in the world, yet men of high standing would take notice sufficient to excite the public mind against me, and create a bitter persecution; and this was common among all the sects—all united to persecute me.",
                            "verse": 22
                        },
                        {
                            "reference": "Joseph Smith—History 1:23",
                            "text": "It caused me serious reflection then, and often has since, how very strange it was that an obscure boy, of a little over fourteen years of age, and one, too, who was doomed to the necessity of obtaining a scanty maintenance by his daily labor, should be thought a character of sufficient importance to attract the attention of the great ones of the most popular sects of the day, and in a manner to create in them a spirit of the most bitter persecution and reviling. But strange or not, so it was, and it was often the cause of great sorrow to myself.",
                            "verse": 23
                        },
                        {
                            "reference": "Joseph Smith—History 1:24",
                            "text": "However, it was nevertheless a fact that I had beheld a vision. I have thought since, that I felt much like Paul, when he made his defense before King Agrippa, and related the account of the vision he had when he saw a light, and heard a voice; but still there were but few who believed him; some said he was dishonest, others said he was mad; and he was ridiculed and reviled. But all this did not destroy the reality of his vision. He had seen a vision, he knew he had, and all the persecution under heaven could not make it otherwise; and though they should persecute him unto death, yet he knew, and would know to his latest breath, that he had both seen a light and heard a voice speaking unto him, and all the world could not make him think or believe otherwise.",
                            "verse": 24
                        },
                        {
                            "reference": "Joseph Smith—History 1:25",
                            "text": "So it was with me. I had actually seen a light, and in the midst of that light I saw two Personages, and they did in reality speak to me; and though I was hated and persecuted for saying that I had seen a vision, yet it was true; and while they were persecuting me, reviling me, and speaking all manner of evil against me falsely for so saying, I was led to say in my heart: Why persecute me for telling the truth? I have actually seen a vision; and who am I that I can withstand God, or why does the world think to make me deny what I have actually seen? For I had seen a vision; I knew it, and I knew that God knew it, and I could not deny it, neither dared I do it; at least I knew that by so doing I would offend God, and come under condemnation.",
                            "verse": 25
                        },
                        {
                            "reference": "Joseph Smith—History 1:26",
                            "text": "I had now got my mind satisfied so far as the sectarian world was concerned—that it was not my duty to join with any of them, but to continue as I was until further directed. I had found the testimony of James to be true—that a man who lacked wisdom might ask of God, and obtain, and not be upbraided.",
                            "verse": 26
                        },
                        {
                            "reference": "Joseph Smith—History 1:27",
                            "text": "I continued to pursue my common vocations in life until the twenty-first of September, one thousand eight hundred and twenty-three, all the time suffering severe persecution at the hands of all classes of men, both religious and irreligious, because I continued to affirm that I had seen a vision.",
                            "verse": 27
                        },
                        {
                            "reference": "Joseph Smith—History 1:28",
                            "text": "During the space of time which intervened between the time I had the vision and the year eighteen hundred and twenty-three—having been forbidden to join any of the religious sects of the day, and being of very tender years, and persecuted by those who ought to have been my friends and to have treated me kindly, and if they supposed me to be deluded to have endeavored in a proper and affectionate manner to have reclaimed me—I was left to all kinds of temptations; and, mingling with all kinds of society, I frequently fell into many foolish errors, and displayed the weakness of youth, and the foibles of human nature; which, I am sorry to say, led me into divers temptations, offensive in the sight of God. In making this confession, no one need suppose me guilty of any great or malignant sins. A disposition to commit such was never in my nature. But I was guilty of levity, and sometimes associated with jovial company, etc., not consistent with that character which ought to be maintained by one who was called of God as I had been. But this will not seem very strange to any one who recollects my youth, and is acquainted with my native cheery temperament.",
                            "verse": 28
                        },
                        {
                            "reference": "Joseph Smith—History 1:29",
                            "text": "In consequence of these things, I often felt condemned for my weakness and imperfections; when, on the evening of the above-mentioned twenty-first of September, after I had retired to my bed for the night, I betook myself to prayer and supplication to Almighty God for forgiveness of all my sins and follies, and also for a manifestation to me, that I might know of my state and standing before him; for I had full confidence in obtaining a divine manifestation, as I previously had one.",
                            "verse": 29
                        },
                        {
                            "reference": "Joseph Smith—History 1:30",
                            "text": "While I was thus in the act of calling upon God, I discovered a light appearing in my room, which continued to increase until the room was lighter than at noonday, when immediately a personage appeared at my bedside, standing in the air, for his feet did not touch the floor.",
                            "verse": 30
                        },
                        {
                            "reference": "Joseph Smith—History 1:31",
                            "text": "He had on a loose robe of most exquisite whiteness. It was a whiteness beyond anything earthly I had ever seen; nor do I believe that any earthly thing could be made to appear so exceedingly white and brilliant. His hands were naked, and his arms also, a little above the wrist; so, also, were his feet naked, as were his legs, a little above the ankles. His head and neck were also bare. I could discover that he had no other clothing on but this robe, as it was open, so that I could see into his bosom.",
                            "verse": 31
                        },
                        {
                            "reference": "Joseph Smith—History 1:32",
                            "text": "Not only was his robe exceedingly white, but his whole person was glorious beyond description, and his countenance truly like lightning. The room was exceedingly light, but not so very bright as immediately around his person. When I first looked upon him, I was afraid; but the fear soon left me.",
                            "verse": 32
                        },
                        {
                            "reference": "Joseph Smith—History 1:33",
                            "text": "He called me by name, and said unto me that he was a messenger sent from the presence of God to me, and that his name was Moroni; that God had a work for me to do; and that my name should be had for good and evil among all nations, kindreds, and tongues, or that it should be both good and evil spoken of among all people.",
                            "verse": 33
                        },
                        {
                            "reference": "Joseph Smith—History 1:34",
                            "text": "He said there was a book deposited, written upon gold plates, giving an account of the former inhabitants of this continent, and the source from whence they sprang. He also said that the fulness of the everlasting Gospel was contained in it, as delivered by the Savior to the ancient inhabitants;",
                            "verse": 34
                        },
                        {
                            "reference": "Joseph Smith—History 1:35",
                            "text": "Also, that there were two stones in silver bows—and these stones, fastened to a breastplate, constituted what is called the Urim and Thummim—deposited with the plates; and the possession and use of these stones were what constituted \"seers\" in ancient or former times; and that God had prepared them for the purpose of translating the book.",
                            "verse": 35
                        },
                        {
                            "reference": "Joseph Smith—History 1:36",
                            "text": "After telling me these things, he commenced quoting the prophecies of the Old Testament. He first quoted part of the third chapter of Malachi; and he quoted also the fourth or last chapter of the same prophecy, though with a little variation from the way it reads in our Bibles. Instead of quoting the first verse as it reads in our books, he quoted it thus:",
                            "verse": 36
                        },
                        {
                            "reference": "Joseph Smith—History 1:37",
                            "text": "For behold, the day cometh that shall burn as an oven, and all the proud, yea, and all that do wickedly shall burn as stubble; for they that come shall burn them, saith the Lord of Hosts, that it shall leave them neither root nor branch.",
                            "verse": 37
                        },
                        {
                            "reference": "Joseph Smith—History 1:38",
                            "text": "And again, he quoted the fifth verse thus: Behold, I will reveal unto you the Priesthood, by the hand of Elijah the prophet, before the coming of the great and dreadful day of the Lord.",
                            "verse": 38
                        },
                        {
                            "reference": "Joseph Smith—History 1:39",
                            "text": "He also quoted the next verse differently: And he shall plant in the hearts of the children the promises made to the fathers, and the hearts of the children shall turn to their fathers. If it were not so, the whole earth would be utterly wasted at his coming.",
                            "verse": 39
                        },
                        {
                            "reference": "Joseph Smith—History 1:40",
                            "text": "In addition to these, he quoted the eleventh chapter of Isaiah, saying that it was about to be fulfilled. He quoted also the third chapter of Acts, twenty-second and twenty-third verses, precisely as they stand in our New Testament. He said that that prophet was Christ; but the day had not yet come when \"they who would not hear his voice should be cut off from among the people,\" but soon would come.",
                            "verse": 40
                        },
                        {
                            "reference": "Joseph Smith—History 1:41",
                            "text": "He also quoted the second chapter of Joel, from the twenty-eighth verse to the last. He also said that this was not yet fulfilled, but was soon to be. And he further stated that the fulness of the Gentiles was soon to come in. He quoted many other passages of scripture, and offered many explanations which cannot be mentioned here.",
                            "verse": 41
                        },
                        {
                            "reference": "Joseph Smith—History 1:42",
                            "text": "Again, he told me, that when I got those plates of which he had spoken—for the time that they should be obtained was not yet fulfilled—I should not show them to any person; neither the breastplate with the Urim and Thummim; only to those to whom I should be commanded to show them; if I did I should be destroyed. While he was conversing with me about the plates, the vision was opened to my mind that I could see the place where the plates were deposited, and that so clearly and distinctly that I knew the place again when I visited it.",
                            "verse": 42
                        },
                        {
                            "reference": "Joseph Smith—History 1:43",
                            "text": "After this communication, I saw the light in the room begin to gather immediately around the person of him who had been speaking to me, and it continued to do so until the room was again left dark, except just around him; when, instantly I saw, as it were, a conduit open right up into heaven, and he ascended till he entirely disappeared, and the room was left as it had been before this heavenly light had made its appearance.",
                            "verse": 43
                        },
                        {
                            "reference": "Joseph Smith—History 1:44",
                            "text": "I lay musing on the singularity of the scene, and marveling greatly at what had been told to me by this extraordinary messenger; when, in the midst of my meditation, I suddenly discovered that my room was again beginning to get lighted, and in an instant, as it were, the same heavenly messenger was again by my bedside.",
                            "verse": 44
                        },
                        {
                            "reference": "Joseph Smith—History 1:45",
                            "text": "He commenced, and again related the very same things which he had done at his first visit, without the least variation; which having done, he informed me of great judgments which were coming upon the earth, with great desolations by famine, sword, and pestilence; and that these grievous judgments would come on the earth in this generation. Having related these things, he again ascended as he had done before.",
                            "verse": 45
                        },
                        {
                            "reference": "Joseph Smith—History 1:46",
                            "text": "By this time, so deep were the impressions made on my mind, that sleep had fled from my eyes, and I lay overwhelmed in astonishment at what I had both seen and heard. But what was my surprise when again I beheld the same messenger at my bedside, and heard him rehearse or repeat over again to me the same things as before; and added a caution to me, telling me that Satan would try to tempt me (in consequence of the indigent circumstances of my father's family), to get the plates for the purpose of getting rich. This he forbade me, saying that I must have no other object in view in getting the plates but to glorify God, and must not be influenced by any other motive than that of building his kingdom; otherwise I could not get them.",
                            "verse": 46
                        },
                        {
                            "reference": "Joseph Smith—History 1:47",
                            "text": "After this third visit, he again ascended into heaven as before, and I was again left to ponder on the strangeness of what I had just experienced; when almost immediately after the heavenly messenger had ascended from me for the third time, the cock crowed, and I found that day was approaching, so that our interviews must have occupied the whole of that night.",
                            "verse": 47
                        },
                        {
                            "reference": "Joseph Smith—History 1:48",
                            "text": "I shortly after arose from my bed, and, as usual, went to the necessary labors of the day; but, in attempting to work as at other times, I found my strength so exhausted as to render me entirely unable. My father, who was laboring along with me, discovered something to be wrong with me, and told me to go home. I started with the intention of going to the house; but, in attempting to cross the fence out of the field where we were, my strength entirely failed me, and I fell helpless on the ground, and for a time was quite unconscious of anything.",
                            "verse": 48
                        },
                        {
                            "reference": "Joseph Smith—History 1:49",
                            "text": "The first thing that I can recollect was a voice speaking unto me, calling me by name. I looked up, and beheld the same messenger standing over my head, surrounded by light as before. He then again related unto me all that he had related to me the previous night, and commanded me to go to my father and tell him of the vision and commandments which I had received.",
                            "verse": 49
                        },
                        {
                            "reference": "Joseph Smith—History 1:50",
                            "text": "I obeyed; I returned to my father in the field, and rehearsed the whole matter to him. He replied to me that it was of God, and told me to go and do as commanded by the messenger. I left the field, and went to the place where the messenger had told me the plates were deposited; and owing to the distinctness of the vision which I had had concerning it, I knew the place the instant that I arrived there.",
                            "verse": 50
                        },
                        {
                            "reference": "Joseph Smith—History 1:51",
                            "text": "Convenient to the village of Manchester, Ontario county, New York, stands a hill of considerable size, and the most elevated of any in the neighborhood. On the west side of this hill, not far from the top, under a stone of considerable size, lay the plates, deposited in a stone box. This stone was thick and rounding in the middle on the upper side, and thinner towards the edges, so that the middle part of it was visible above the ground, but the edge all around was covered with earth.",
                            "verse": 51
                        },
                        {
                            "reference": "Joseph Smith—History 1:52",
                            "text": "Having removed the earth, I obtained a lever, which I got fixed under the edge of the stone, and with a little exertion raised it up. I looked in, and there indeed did I behold the plates, the Urim and Thummim, and the breastplate, as stated by the messenger. The box in which they lay was formed by laying stones together in some kind of cement. In the bottom of the box were laid two stones crossways of the box, and on these stones lay the plates and the other things with them.",
                            "verse": 52
                        },
                        {
                            "reference": "Joseph Smith—History 1:53",
                            "text": "I made an attempt to take them out, but was forbidden by the messenger, and was again informed that the time for bringing them forth had not yet arrived, neither would it, until four years from that time; but he told me that I should come to that place precisely in one year from that time, and that he would there meet with me, and that I should continue to do so until the time should come for obtaining the plates.",
                            "verse": 53
                        },
                        {
                            "reference": "Joseph Smith—History 1:54",
                            "text": "Accordingly, as I had been commanded, I went at the end of each year, and at each time I found the same messenger there, and received instruction and intelligence from him at each of our interviews, respecting what the Lord was going to do, and how and in what manner his kingdom was to be conducted in the last days.",
                            "verse": 54
                        },
                        {
                            "reference": "Joseph Smith—History 1:55",
                            "text": "As my father's worldly circumstances were very limited, we were under the necessity of laboring with our hands, hiring out by day's work and otherwise, as we could get opportunity. Sometimes we were at home, and sometimes abroad, and by continuous labor were enabled to get a comfortable maintenance.",
                            "verse": 55
                        },
                        {
                            "reference": "Joseph Smith—History 1:56",
                            "text": "In the year 1823 my father's family met with a great affliction by the death of my eldest brother, Alvin. In the month of October, 1825, I hired with an old gentleman by the name of Josiah Stoal, who lived in Chenango county, State of New York. He had heard something of a silver mine having been opened by the Spaniards in Harmony, Susquehanna county, State of Pennsylvania; and had, previous to my hiring to him, been digging, in order, if possible, to discover the mine. After I went to live with him, he took me, with the rest of his hands, to dig for the silver mine, at which I continued to work for nearly a month, without success in our undertaking, and finally I prevailed with the old gentleman to cease digging after it. Hence arose the very prevalent story of my having been a money-digger.",
                            "verse": 56
                        },
                        {
                            "reference": "Joseph Smith—History 1:57",
                            "text": "During the time that I was thus employed, I was put to board with a Mr. Isaac Hale, of that place; it was there I first saw my wife (his daughter), Emma Hale. On the 18th of January, 1827, we were married, while I was yet employed in the service of Mr. Stoal.",
                            "verse": 57
                        },
                        {
                            "reference": "Joseph Smith—History 1:58",
                            "text": "Owing to my continuing to assert that I had seen a vision, persecution still followed me, and my wife's father's family were very much opposed to our being married. I was, therefore, under the necessity of taking her elsewhere; so we went and were married at the house of Squire Tarbill, in South Bainbridge, Chenango county, New York. Immediately after my marriage, I left Mr. Stoal's, and went to my father's, and farmed with him that season.",
                            "verse": 58
                        },
                        {
                            "reference": "Joseph Smith—History 1:59",
                            "text": "At length the time arrived for obtaining the plates, the Urim and Thummim, and the breastplate. On the twenty-second day of September, one thousand eight hundred and twenty-seven, having gone as usual at the end of another year to the place where they were deposited, the same heavenly messenger delivered them up to me with this charge: that I should be responsible for them; that if I should let them go carelessly, or through any neglect of mine, I should be cut off; but that if I would use all my endeavors to preserve them, until he, the messenger, should call for them, they should be protected.",
                            "verse": 59
                        },
                        {
                            "reference": "Joseph Smith—History 1:60",
                            "text": "I soon found out the reason why I had received such strict charges to keep them safe, and why it was that the messenger had said that when I had done what was required at my hand, he would call for them. For no sooner was it known that I had them, than the most strenuous exertions were used to get them from me. Every stratagem that could be invented was resorted to for that purpose. The persecution became more bitter and severe than before, and multitudes were on the alert continually to get them from me if possible. But by the wisdom of God, they remained safe in my hands, until I had accomplished by them what was required at my hand. When, according to arrangements, the messenger called for them, I delivered them up to him; and he has them in his charge until this day, being the second day of May, one thousand eight hundred and thirty-eight.",
                            "verse": 60
                        },
                        {
                            "reference": "Joseph Smith—History 1:61",
                            "text": "The excitement, however, still continued, and rumor with her thousand tongues was all the time employed in circulating falsehoods about my father's family, and about myself. If I were to relate a thousandth part of them, it would fill up volumes. The persecution, however, became so intolerable that I was under the necessity of leaving Manchester, and going with my wife to Susquehanna county, in the State of Pennsylvania. While preparing to start—being very poor, and the persecution so heavy upon us that there was no probability that we would ever be otherwise—in the midst of our afflictions we found a friend in a gentleman by the name of Martin Harris, who came to us and gave me fifty dollars to assist us on our journey. Mr. Harris was a resident of Palmyra township, Wayne county, in the State of New York, and a farmer of respectability.",
                            "verse": 61
                        },
                        {
                            "reference": "Joseph Smith—History 1:62",
                            "text": "By this timely aid was I enabled to reach the place of my destination in Pennsylvania; and immediately after my arrival there I commenced copying the characters off the plates. I copied a considerable number of them, and by means of the Urim and Thummim I translated some of them, which I did between the time I arrived at the house of my wife's father, in the month of December, and the February following.",
                            "verse": 62
                        },
                        {
                            "reference": "Joseph Smith—History 1:63",
                            "text": "Sometime in this month of February, the aforementioned Mr. Martin Harris came to our place, got the characters which I had drawn off the plates, and started with them to the city of New York. For what took place relative to him and the characters, I refer to his own account of the circumstances, as he related them to me after his return, which was as follows:",
                            "verse": 63
                        },
                        {
                            "reference": "Joseph Smith—History 1:64",
                            "text": "\"I went to the city of New York, and presented the characters which had been translated, with the translation thereof, to Professor Charles Anthon, a gentleman celebrated for his literary attainments. Professor Anthon stated that the translation was correct, more so than any he had before seen translated from the Egyptian. I then showed him those which were not yet translated, and he said that they were Egyptian, Chaldaic, Assyriac, and Arabic; and he said they were true characters. He gave me a certificate, certifying to the people of Palmyra that they were true characters, and that the translation of such of them as had been translated was also correct. I took the certificate and put it into my pocket, and was just leaving the house, when Mr. Anthon called me back, and asked me how the young man found out that there were gold plates in the place where he found them. I answered that an angel of God had revealed it unto him.",
                            "verse": 64
                        },
                        {
                            "reference": "Joseph Smith—History 1:65",
                            "text": "\"He then said to me, 'Let me see that certificate.' I accordingly took it out of my pocket and gave it to him, when he took it and tore it to pieces, saying that there was no such thing now as ministering of angels, and that if I would bring the plates to him he would translate them. I informed him that part of the plates were sealed, and that I was forbidden to bring them. He replied, 'I cannot read a sealed book.' I left him and went to Dr. Mitchell, who sanctioned what Professor Anthon had said respecting both the characters and the translation.\"",
                            "verse": 65
                        },
                        {
                            "reference": "Joseph Smith—History 1:66",
                            "text": "On the 5th day of April, 1829, Oliver Cowdery came to my house, until which time I had never seen him. He stated to me that having been teaching school in the neighborhood where my father resided, and my father being one of those who sent to the school, he went to board for a season at his house, and while there the family related to him the circumstances of my having received the plates, and accordingly he had come to make inquiries of me.",
                            "verse": 66
                        },
                        {
                            "reference": "Joseph Smith—History 1:67",
                            "text": "Two days after the arrival of Mr. Cowdery (being the 7th of April) I commenced to translate the Book of Mormon, and he began to write for me.",
                            "verse": 67
                        },
                        {
                            "reference": "Joseph Smith—History 1:68",
                            "text": "We still continued the work of translation, when, in the ensuing month (May, 1829), we on a certain day went into the woods to pray and inquire of the Lord respecting baptism for the remission of sins, that we found mentioned in the translation of the plates. While we were thus employed, praying and calling upon the Lord, a messenger from heaven descended in a cloud of light, and having laid his hands upon us, he ordained us, saying:",
                            "verse": 68
                        },
                        {
                            "reference": "Joseph Smith—History 1:69",
                            "text": "Upon you my fellow servants, in the name of Messiah, I confer the Priesthood of Aaron, which holds the keys of the ministering of angels, and of the gospel of repentance, and of baptism by immersion for the remission of sins; and this shall never be taken again from the earth until the sons of Levi do offer again an offering unto the Lord in righteousness.",
                            "verse": 69
                        },
                        {
                            "reference": "Joseph Smith—History 1:70",
                            "text": "He said this Aaronic Priesthood had not the power of laying on hands for the gift of the Holy Ghost, but that this should be conferred on us hereafter; and he commanded us to go and be baptized, and gave us directions that I should baptize Oliver Cowdery, and that afterwards he should baptize me.",
                            "verse": 70
                        },
                        {
                            "reference": "Joseph Smith—History 1:71",
                            "text": "Accordingly we went and were baptized. I baptized him first, and afterwards he baptized me—after which I laid my hands upon his head and ordained him to the Aaronic Priesthood, and afterwards he laid his hands on me and ordained me to the same Priesthood—for so we were commanded.",
                            "verse": 71
                        },
                        {
                            "reference": "Joseph Smith—History 1:72",
                            "text": "The messenger who visited us on this occasion and conferred this Priesthood upon us, said that his name was John, the same that is called John the Baptist in the New Testament, and that he acted under the direction of Peter, James and John, who held the keys of the Priesthood of Melchizedek, which Priesthood, he said, would in due time be conferred on us, and that I should be called the first Elder of the Church, and he (Oliver Cowdery) the second. It was on the fifteenth day of May, 1829, that we were ordained under the hand of this messenger, and baptized.",
                            "verse": 72
                        },
                        {
                            "reference": "Joseph Smith—History 1:73",
                            "text": "Immediately on our coming up out of the water after we had been baptized, we experienced great and glorious blessings from our Heavenly Father. No sooner had I baptized Oliver Cowdery, than the Holy Ghost fell upon him, and he stood up and prophesied many things which should shortly come to pass. And again, so soon as I had been baptized by him, I also had the spirit of prophecy, when, standing up, I prophesied concerning the rise of this Church, and many other things connected with the Church, and this generation of the children of men. We were filled with the Holy Ghost, and rejoiced in the God of our salvation.",
                            "verse": 73
                        },
                        {
                            "reference": "Joseph Smith—History 1:74",
                            "text": "Our minds being now enlightened, we began to have the scriptures laid open to our understandings, and the true meaning and intention of their more mysterious passages revealed unto us in a manner which we never could attain to previously, nor ever before had thought of. In the meantime we were forced to keep secret the circumstances of having received the Priesthood and our having been baptized, owing to a spirit of persecution which had already manifested itself in the neighborhood.",
                            "verse": 74
                        },
                        {
                            "reference": "Joseph Smith—History 1:75",
                            "text": "We had been threatened with being mobbed, from time to time, and this, too, by professors of religion. And their intentions of mobbing us were only counteracted by the influence of my wife's father's family (under Divine providence), who had become very friendly to me, and who were opposed to mobs, and were willing that I should be allowed to continue the work of translation without interruption; and therefore offered and promised us protection from all unlawful proceedings, as far as in them lay.",
                            "verse": 75
                        }
                    ]
                }
            ],
			"full_subtitle": "Extracts from the History of Joseph Smith, the Prophet",
			"full_title": "Joseph Smith—History",
            "lds_slug": "js-h"
        },
        {
            "book": "Articles of Faith",
            "chapters": [
                {
                    "chapter": 1,
                    "reference": "Articles of Faith 1",
                    "verses": [
                        {
                            "reference": "Articles of Faith 1:1",
                            "text": "We believe in God, the Eternal Father, and in His Son, Jesus Christ, and in the Holy Ghost.",
                            "verse": 1
                        },
                        {
                            "reference": "Articles of Faith 1:2",
                            "text": "We believe that men will be punished for their own sins, and not for Adam's transgression.",
                            "verse": 2
                        },
                        {
                            "reference": "Articles of Faith 1:3",
                            "text": "We believe that through the Atonement of Christ, all mankind may be saved, by obedience to the laws and ordinances of the Gospel.",
                            "verse": 3
                        },
                        {
                            "reference": "Articles of Faith 1:4",
                            "text": "We believe that the first principles and ordinances of the Gospel are: first, Faith in the Lord Jesus Christ; second, Repentance; third, Baptism by immersion for the remission of sins; fourth, Laying on of hands for the gift of the Holy Ghost.",
                            "verse": 4
                        },
                        {
                            "reference": "Articles of Faith 1:5",
                            "text": "We believe that a man must be called of God, by prophecy, and by the laying on of hands by those who are in authority, to preach the Gospel and administer in the ordinances thereof.",
                            "verse": 5
                        },
                        {
                            "reference": "Articles of Faith 1:6",
                            "text": "We believe in the same organization that existed in the Primitive Church, namely, apostles, prophets, pastors, teachers, evangelists, and so forth.",
                            "verse": 6
                        },
                        {
                            "reference": "Articles of Faith 1:7",
                            "text": "We believe in the gift of tongues, prophecy, revelation, visions, healing, interpretation of tongues, and so forth.",
                            "verse": 7
                        },
                        {
                            "reference": "Articles of Faith 1:8",
                            "text": "We believe the Bible to be the word of God as far as it is translated correctly; we also believe the Book of Mormon to be the word of God.",
                            "verse": 8
                        },
                        {
                            "reference": "Articles of Faith 1:9",
                            "text": "We believe all that God has revealed, all that He does now reveal, and we believe that He will yet reveal many great and important things pertaining to the Kingdom of God.",
                            "verse": 9
                        },
                        {
                            "reference": "Articles of Faith 1:10",
                            "text": "We believe in the literal gathering of Israel and in the restoration of the Ten Tribes; that Zion (the New Jerusalem) will be built upon the American continent; that Christ will reign personally upon the earth; and, that the earth will be renewed and receive its paradisiacal glory.",
                            "verse": 10
                        },
                        {
                            "reference": "Articles of Faith 1:11",
                            "text": "We claim the privilege of worshiping Almighty God according to the dictates of our own conscience, and allow all men the same privilege, let them worship how, where, or what they may.",
                            "verse": 11
                        },
                        {
                            "reference": "Articles of Faith 1:12",
                            "text": "We believe in being subject to kings, presidents, rulers, and magistrates, in obeying, honoring, and sustaining the law.",
                            "verse": 12
                        },
                        {
                            "reference": "Articles of Faith 1:13",
                            "text": "We believe in being honest, true, chaste, benevolent, virtuous, and in doing good to all men; indeed, we may say that we follow the admonition of Paul—We believe all things, we hope all things, we have endured many things, and hope to be able to endure all things. If there is anything virtuous, lovely, or of good report or praiseworthy, we seek after these things.",
                            "verse": 13
                        }
                    ]
                }
            ],
			"full_subtitle": "of The Church of Jesus Christ of Latter-day Saints",
			"full_title": "The Articles of Faith",
            "lds_slug": "a-of-f"
        }
    ],
	"last_modified": "2016-10-02",
    "lds_slug": "pgp",
	"subtitle": "A Selection from the Revelations, Translations, and Narrations of Joseph Smith First Prophet, Seer, and Revelator to The Church of Jesus Christ of Latter-day Saints",
	"title": "The Pearl of Great Price",
	"version": 3
}
